{"version": "https://jsonfeed.org/version/1.1", "title": "Matthew Rocklin", "home_page_url": "https://matthewrocklin.com/", "feed_url": "https://matthewrocklin.com/feed_json_updated.json", "description": "Personal site of Matthew Rocklin - thoughts on open source, startups, and engineering", "icon": null, "authors": [], "language": "en", "items": [{"id": "https://matthewrocklin.com/ai-beginners/", "url": "https://matthewrocklin.com/ai-beginners/", "title": "Beginning Again", "content_html": "<h1 id=\"were-all-beginners-again\">We're all Beginners Again<a class=\"headerlink\" href=\"#were-all-beginners-again\" title=\"Permanent link\">&para;</a></h1>\n<p>While interviewing early adopters of <a href=\"/introducing-claude-chic\">Claude Chic</a> I heard two common refrains:</p>\n<ul>\n<li>\"Oh, I'm not very advanced with AI\"</li>\n<li>\"Programming feels fun again!\"</li>\n</ul>\n<p>These feelings were universal.  I thought they'd be good to share out loud.</p>\n<h2 id=\"beginning-again\">Beginning again<a class=\"headerlink\" href=\"#beginning-again\" title=\"Permanent link\">&para;</a></h2>\n<p>Everyone was anxious sharing how they worked with AI, afraid of being judged for not being advanced enough.  Here's the thing:</p>\n<blockquote>\n<p>No one is very advanced with AI</p>\n</blockquote>\n<p>No one I spoke with was using multi-agent swarms or GasTown or whatever.  But everyone <em>was</em> doing something different.  The space is wide-open and no one has the answer yet.  This should make us fearless.</p>\n<p>We're all beginners again, and that's what makes it fun.  It's like being twenty years old at university, the world full of possibilities.</p>\n<h2 id=\"programming-feels-fun-again\">Programming feels fun again<a class=\"headerlink\" href=\"#programming-feels-fun-again\" title=\"Permanent link\">&para;</a></h2>\n<p>Everyone is in good spirits, despite the anxiety.</p>\n<p>To me this feels like Python did 15 years ago when there was so much to build and so much new ground to cover.  We were in a green field inventing the future against all odds, rather than maintaining legacy software under an increasing weight of success.</p>\n<p>Today I see people working on personal side-projects, goofing around, playing.</p>\n<p>I'm reminded of these quotes from director Francis Ford Coppola during the making of his recent film/boondoggle, Megalopolis</p>\n<blockquote>\n<p>\"You know why I'm doing this?  I have money, I already have fame, I already have Oscars.\"<br/>\n\"What do I get that I want?  Tell me.\"</p>\n<p>\"Fun!  I wanna have Fun.\"</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>\"All the great things in life come from play, never from work, never from toil\".</p>\n<p>\"Toil gives you nothing. Play gives you everything.\"</p>\n</blockquote>\n<p>We're having fun again, and that's fantastic.</p>\n<h2 id=\"learning-from-python\">Learning from Python<a class=\"headerlink\" href=\"#learning-from-python\" title=\"Permanent link\">&para;</a></h2>\n<p>I had the privilege to experience the growth of the Python data ecosystem from the inside, before it became cool.  The way I feel now reminds me of how we felt then.</p>\n<p>Not everything is the same though.  I think we could improve our culture of communication.  What I'd like to see more of:</p>\n<ul>\n<li>More casual sharing of <em>how</em> we work (not just the tools or products we've built)</li>\n<li>More questioning and critical thinking about popular directions (are multi-agent swarms really the way of the future?)</li>\n<li>More chats over beers without an agenda</li>\n</ul>\n<p>With COVID and remote work we've gotten too efficient with our communication.  We need more un-conferences and hallway tracks—the unstructured spaces where real ideas emerge.</p>", "image": "https://matthewrocklin.com/assets/images/social/ai-beginners.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2026-01-27T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/ai-multi-agent/", "url": "https://matthewrocklin.com/ai-multi-agent/", "title": "Multi-Agent Workflows", "content_html": "<h1 id=\"multi-agent-swarms-initial-thoughts\">Multi Agent Swarms: Initial Thoughts<a class=\"headerlink\" href=\"#multi-agent-swarms-initial-thoughts\" title=\"Permanent link\">&para;</a></h1>\n<p>Like many of us, I read articles about systems like <a href=\"https://steve-yegge.medium.com/welcome-to-gas-town-4f25ee16dd04\">Gas\nTown</a> with a\nmixture of wonder and fear:</p>\n<blockquote>\n<p>I'm only using a few agents concurrently!  Am I falling behind?</p>\n</blockquote>\n<p>This is silly of course.  No one is behind because <a href=\"/ai-beginners\">no one knows what they're\ndoing yet</a>.</p>\n<p>Still though, I wanted to explore this topic, so I spent the last couple days\nplaying with multi-agent workflows using <a href=\"/introducing-claude-chic\">Claude\nChic</a>.</p>\n<p>This article is long (sorry!) but here is a helpful TOC.  If you don't feel like a long read I recommend skipping to the <a href=\"#lessons-learned\">Lessons Learned</a>.</p>\n<ol>\n<li><a href=\"#obviously-good-simple-multi-agent-workflows\">Obviously Good Simple Multi-Agent Workflows</a></li>\n<li><a href=\"#platform\">Platform</a></li>\n<li><a href=\"#first-experiment-diplomacy\">First Experiment: Diplomacy</a></li>\n<li><a href=\"#second-experiment-session-viewer\">Second Experiment: Session Viewer</a></li>\n<li><a href=\"#lessons-learned\"><strong>Lessons Learned</strong></a> &lt;-- if you read only one section, read this</li>\n<li><a href=\"#experimenting-is-easy\">Experimenting is easy</a></li>\n</ol>\n<h2 id=\"obviously-good-simple-multi-agent-workflows\">Obviously Good Simple Multi-Agent Workflows<a class=\"headerlink\" href=\"#obviously-good-simple-multi-agent-workflows\" title=\"Permanent link\">&para;</a></h2>\n<p>Many of us use multi-agent systems in simple ways that are clearly a benefit:</p>\n<ul>\n<li>\n<p><strong>Plan then Build:</strong> People often have one session make a plan, and then clear out context and start building that plan with a new session.</p>\n<p>This has become common enough that I believe it's now the default in Claude Code.</p>\n</li>\n<li>\n<p><strong>Review:</strong> People ask another agent to review the work of an initial agent.  This tends to produce better results than having the original agent self-review.</p>\n<p>As Wes McKinney writes about <a href=\"https://www.roborev.io/\">RoboRev</a>:</p>\n<blockquote>\n<p>Having a Claude Code session review its own work is so 2025.</p>\n</blockquote>\n</li>\n</ul>\n<p>There's something powerful about having two different agents think about the\nsame problem and communicate about it, even if those two agents run sequentially, and even\nif they communicate by having a human copy-paste between them.</p>\n<h2 id=\"platform\">Platform<a class=\"headerlink\" href=\"#platform\" title=\"Permanent link\">&para;</a></h2>\n<p>I'm using my personal Claude TUI alternative, <a href=\"/introducing-claude-chic\">Claude Chic</a>.\nOriginally built for nicer style, it also has the feature set needed to support multi-agent swarms.</p>\n<ul>\n<li><strong>Start:</strong> Agents can start other agents</li>\n<li><strong>Send:</strong> Agents can send messages to other agents</li>\n<li><strong>Branch:</strong> Agents can create git worktrees</li>\n<li><strong>Merge:</strong> There's an automated commit / rebase / resolve-conflicts / merge loop that\nagents can follow</li>\n</ul>\n<p>I built these tools to help me with human-in-the-loop work, but it turns out\nthey're all you need for multi-agent-swarm workflows.</p>\n<h2 id=\"first-experiment-diplomacy\">First Experiment: Diplomacy<a class=\"headerlink\" href=\"#first-experiment-diplomacy\" title=\"Permanent link\">&para;</a></h2>\n<p>In the initial demo of Claude Chic, I show Claude setting up a game of Chess against itself.</p>\n<video src=\"https://github.com/user-attachments/assets/735ebc91-335e-4476-8fde-f49ce1df056a\" autoplay loop muted playsinline style=\"max-width: 100%\"></video>\n\n<p>But then I thought</p>\n<ul>\n<li><strong>Q:</strong> \"what's more intense than Chess?\"\n    <strong>A:</strong> \"Diplomacy\"</li>\n</ul>\n<p>Diplomacy, if you're not familiar, is like \"Risk on Steroids without Dice\".\nIt's a game of pure discussion and guile where seven players try to dominate\n1908 Europe.  Claude knows the game (of course) and so I asked it to set up a game among agents.</p>\n<video src=\"https://github.com/user-attachments/assets/38205b08-fd13-4b84-b153-9f98eab1d759\" autoplay loop muted playsinline style=\"max-width: 100%\"></video>\n\n<p>The gameplay was fascinating to watch.  Briefly:</p>\n<ul>\n<li>Game starts out tame and typical</li>\n<li>\n<p>Austria thinks it's doing well, but everyone betrays it</p>\n<p>Interestingly, the other players joke about Austria behind its back</p>\n</li>\n<li>\n<p>Russia dominates early on, supported by Turkey</p>\n</li>\n<li>\n<p>Germany, noticing Russia's rise, convinces everyone else to gang up against Russia</p>\n<p>The amount of inter-agent traffic in and out of the Germany agent during this period was intense.</p>\n</li>\n<li>\n<p>Russia, cowed, makes a deal with Germany to let it survive</p>\n</li>\n</ul>\n<p>Watching the agents play was no less fascinating than watching humans play, and\nresulted in behaviors I found surprising from AI:</p>\n<blockquote>\n<p>Multiple coordinating agents are capable of more sophisticated behavior than single agents</p>\n</blockquote>\n<p>Silly game, useful lesson.  I wanted to try things out in practice.</p>\n<h2 id=\"second-experiment-session-viewer\">Second Experiment: Session Viewer<a class=\"headerlink\" href=\"#second-experiment-session-viewer\" title=\"Permanent link\">&para;</a></h2>\n<p>I wanted to look at multi-agent sessions like the one I had just played, and so\ndecided to have Claude(s) build a session viewer for me that I would turn into\nsomething with a shared timeline.</p>\n<p>I tried this three times with three different prompts, learning each time.\nEventually we got to something like this without much human intervention:</p>\n<p><img alt=\"Simple Session Viewer\" src=\"https://github.com/user-attachments/assets/247ad909-72ae-4365-8559-3e21d63153f6\" /></p>\n<p>It's not great, but it works.</p>\n<h3 id=\"prompts\">Prompts<a class=\"headerlink\" href=\"#prompts\" title=\"Permanent link\">&para;</a></h3>\n<p>They're not beautiful, but here are the prompts I used.  You can tell how I learned from one into the next.</p>\n<details class=\"faq\">\n<summary>First Try</summary>\n<p>I'm curious about trying an agent swarm technique in development. I was thinking as a project we might try adding a react electron version of this application.</p>\n<p>We'd want to have one agent (you) doing a lot of the orchestration, but we'd want other agents for planning, executing each task, reviewing, testing, etc.. You wouldn't do any work directly because you'd be conserving your context to control others.</p>\n<p>I want you to think hard about this and how to execute well.</p>\n</details>\n<details class=\"faq\">\n<summary>Second Try: I encourage communication</summary>\n<p>Let's play with multi-agent swarm systems. As a project, I want to build a viewer for sessions. I'm thinking that this is probably a local application, maybe electron that takes a session file and renders it nicely. Eventually I'm going to want to render a few of these side-by-side (to better understand multi-agent systems), but I think that to start we probably just want to get to a milestone where we have an app that runs that can present a session nicely.</p>\n<p>For tech we're going to want react/shadcn/tailwind with zustand for state.</p>\n<p>For design we're going to want to copy our theme and styling here.</p>\n<p>For execution I think we probably want different agents for planning, building, and reviewing. Each building agent should also launch an agent to review its work as it gets close to done (or we should launch it if it forgets). Assuming we use worktrees we're going to want to merge work as it completes rather than all at once. Probably we want a separate integration agent for this. Agents should be encouraged to ask each other questions and collaborate. We shouldn't do much work in this agent. We need to preserve our context.</p>\n<p>Think about how best to organize this and then set it going.</p>\n</details>\n<details class=\"faq\">\n<summary>Third try. I wanted to limit concurrency.</summary>\n<p>I'd like to experiment with agent swarms.</p>\n<p>As a project, I'd like us to build a session viewer that takes in a session, like the .jsonl file on the Desktop, and renders it similarly to how we do in the app, but with an electron app using react/tailwind/shadcn.</p>\n<p>As we work on things I want you to use different agents in different roles.</p>\n<ul>\n<li>For our architecture I suspect that we'll want an agent to make an overall plan,</li>\n<li>and then we'll want to break apart that plan into a set of tasks with dependencies that agents can work on independently.</li>\n<li>We won't want to start everything at once of course. We'll want to pay attention to laying a good foundation first and making sure it's good before moving on.</li>\n<li>As we can parallelize we will.</li>\n<li>Also, as any agent starts to finish up work they should use the /review skill to create another agent to review their efforts.</li>\n<li>When they're done they should use the finalize_worktree mcp command to work on merging their work to this upstream viewer branch, which will be the target of all of our work.</li>\n</ul>\n<p>You won't do much work, instead saving your context to help orchestrate the other agents.</p>\n<p>Think hard about how to do this well.</p>\n</details>\n<p>If I were to do this again, I think I would sequentialize the entire process.  Parallelism didn't buy much.</p>\n<h3 id=\"the-overall-experience-was-mediocre\">The overall experience was mediocre<a class=\"headerlink\" href=\"#the-overall-experience-was-mediocre\" title=\"Permanent link\">&para;</a></h3>\n<p>My experience with agentic swarms was so-so.  That's not surprising.  I'm new at it and bad at it.</p>\n<p>As Steve Yegge (famed multi-agent vibe coder) says:</p>\n<blockquote>\n<p>You will turn into Batman, but you can't just put on the suit and say \"I'm Batman\".</p>\n<p>You've got to learn how the tool-belt works</p>\n</blockquote>\n<p>My experience was learning that I'm definitely not Batman yet.</p>\n<h3 id=\"observations\">Observations<a class=\"headerlink\" href=\"#observations\" title=\"Permanent link\">&para;</a></h3>\n<p>The head agent delegated really well.  It understood that its context was\nprecious and how to create agents to do work.  And the plan that was designed was fine.</p>\n<p>But parallel execution was generally pretty bad.  The agents did fine work, but\nthey mostly ignored each other the first go around.  The second time I\nintentionally prompted the system to chat with peers about the work they were\ndoing, and the third time I encouraged less parallelism.  Still though,\nlack of coordination resulted in lots of strangeness.</p>\n<p>On the plus side, the crap it produced was quickly cleaned up by more AI (the\nsolution to AI problems is more AI).</p>\n<h2 id=\"lessons-learned\">Lessons Learned<a class=\"headerlink\" href=\"#lessons-learned\" title=\"Permanent link\">&para;</a></h2>\n<p>As with any philosophy, we should neither accept nor reject it, but should take\nfrom it the parts that suit us.</p>\n<p>In that spirit, here are my current lessons on multi-agent behavior.</p>\n<h3 id=\"separate-reviewer\">Separate Reviewer 👍<a class=\"headerlink\" href=\"#separate-reviewer\" title=\"Permanent link\">&para;</a></h3>\n<p>Upon finishing work I used to ask Claude to review its own work:</p>\n<blockquote>\n<p>Let's review our recent changes and see if there is anything we can clean up or simplify</p>\n</blockquote>\n<p>Now I still do that, but I follow up with:</p>\n<blockquote>\n<p>Start another agent and ask it to review our work</p>\n</blockquote>\n<p>They're both quite useful.</p>\n<h3 id=\"fresh-perspective\">Fresh Perspective 👍<a class=\"headerlink\" href=\"#fresh-perspective\" title=\"Permanent link\">&para;</a></h3>\n<p>Agents get tired.  If an agent finishes an especially long session and its context is near 60-70% I'll often ask the reviewing agent to take over and implement the changes.</p>\n<p>It's better, of course, to avoid this with well-scoped work, just like a regular human developer.</p>\n<h3 id=\"mythical-man-month-mythical-ai-minute\">Mythical Man Month ➡️ Mythical AI Minute<a class=\"headerlink\" href=\"#mythical-man-month-mythical-ai-minute\" title=\"Permanent link\">&para;</a></h3>\n<p>Also like humans, sometimes teams don't perform as well as single developers.</p>\n<p>There's a real cost to coordination that needs to be outweighed by the benefits of speed.  AI agents are so fast that it's not clear to me when we'd want multiple agents working concurrently on the same code—most tasks finish before coordination overhead would pay off.</p>\n<p>My experiment would have been better with many agents, each agent running after the other finished.</p>\n<h3 id=\"agent-support\">Agent Support 👍<a class=\"headerlink\" href=\"#agent-support\" title=\"Permanent link\">&para;</a></h3>\n<p>Increasingly, the model I have for hard problems is to work with one key agent at a time, and fire off supporting agents to handle tangential work (research, review, performance testing).</p>\n<p>It's valuable to keep a key agent on task. (also like humans)</p>\n<h3 id=\"human-coordination\">Human Coordination 🧠<a class=\"headerlink\" href=\"#human-coordination\" title=\"Permanent link\">&para;</a></h3>\n<p>I am not (yet) a fan of YOLO Swarms.  I want to be involved.</p>\n<p>Said differently, all the work I'm doing is sufficiently important to me that I'm happy to pay attention to it.  I'm curious about how to best optimize my ability to pay attention to AI work.</p>\n<p>I don't think this is universally true.  For example during Dask's peak, OSS maintenance was such that I would have welcomed agents handling the first layer of support.  Very few of us are in that situation though.</p>\n<h3 id=\"human-oriented-ai-development\">Human-Oriented AI Development<a class=\"headerlink\" href=\"#human-oriented-ai-development\" title=\"Permanent link\">&para;</a></h3>\n<p>Working on Claude Chic has made me increasingly interested in how I work as a developer, and how to optimize that experience.  Rather than ask:</p>\n<blockquote>\n<p>How can I use multi-agent swarms?</p>\n</blockquote>\n<p>I am instead asking:</p>\n<blockquote>\n<p>What is holding me back right now?</p>\n<p>How can I best address that?</p>\n</blockquote>\n<p>Today the answer is around ergonomics and context management rather than concurrency (I feel I already have concurrency in abundance).  There are great multi-agent workflows I've mentioned above that I use daily.  I'm not yet a YOLO Swarm / Gas Town guy.</p>\n<p>I haven't really made up my mind though; I should experiment for more than 48 hours.</p>\n<h2 id=\"experimenting-is-easy\">Experimenting is easy<a class=\"headerlink\" href=\"#experimenting-is-easy\" title=\"Permanent link\">&para;</a></h2>\n<p>This is a blatant ad for <a href=\"/introducing-claude-chic\">Claude Chic</a>, but it was pretty trivial to play with (admittedly bad) swarm architectures.</p>\n<p>Claude has enough of an understanding of swarms that, if you describe what you want and give it the ability to make agents that talk to each other (like Claude Chic does), then you can just start playing immediately.</p>\n<p>Regardless what you think about AI, and regardless how you think about\nfull-auto multi-agent swarms, you should experiment with them.  They are,\nwhatever else, quite interesting.</p>", "image": "https://matthewrocklin.com/assets/images/social/ai-multi-agent.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2026-01-29T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/ai-zealotry/", "url": "https://matthewrocklin.com/ai-zealotry/", "title": "AI Zealotry", "content_html": "<h1 id=\"ai-zealotry\">AI Zealotry<a class=\"headerlink\" href=\"#ai-zealotry\" title=\"Permanent link\">&para;</a></h1>\n<p>I develop with AI today.  It's great.</p>\n<p>There are many articles you can read on why AI is great (or terrible) or how to\nuse it.  This is mine.  I focus on the experience of a senior engineer (and why\nwe in particular should use AI), on my experience operating within the OSS\nPython Data world, and on practical suggestions that I've found myself\nrepeating to colleagues.</p>\n<p>This article contains learned lessons of two types:</p>\n<ul>\n<li><strong>Big Ideas:</strong> Grand(iose) philosophy on why AI is great for experienced programmers</li>\n<li><strong>Tips:</strong> Taken from my workflow using Claude Code</li>\n</ul>\n<p>We'll interleave these two.  I'm hopeful that this approach will make this more fun.</p>\n<h2 id=\"why-ai\">Why AI<a class=\"headerlink\" href=\"#why-ai\" title=\"Permanent link\">&para;</a></h2>\n<p>AI development is more fun.  I do more of what I like (think, experiment,\nwrite) and less of what I don't like (wrestle with computers).</p>\n<p>I feel both that I can move faster and operate in areas that were previously\ninaccessible to me (like frontend).\nExperienced developers should all be doing this.  We're good enough to avoid AI\nSlop, and there's so much we can accomplish today.</p>\n<p>I like this quote from <a href=\"https://www.stochasticlifestyle.com/a-guide-to-gen-ai-llm-vibecoding-for-expert-programmers/\">this blog</a></p>\n<blockquote>\n<p>I get it, you’re too good to vibe code. You’re a senior developer who has been doing this for 20 years and knows the system like the back of your hand.</p>\n<p>[...]</p>\n<p>No, you’re not too good to vibe code. In fact, you’re the only person who should be vibe coding.</p>\n</blockquote>\n<p>I think that really good engineers, the kind that think hard before writing,\ncan have a tremendous impact and fun while developing with AI.  I\nwouldn't ever go back.</p>\n<h2 id=\"why-not-ai\">Why Not AI<a class=\"headerlink\" href=\"#why-not-ai\" title=\"Permanent link\">&para;</a></h2>\n<p>That being said, there are some serious costs and reasonable reservations to AI\ndevelopment.  Let's start by listing those concerns:</p>\n<ul>\n<li>LLMs generate junk</li>\n<li>LLMs generate <em>a lot</em> of junk</li>\n<li>Writing code ourselves builds understanding</li>\n<li>Reviewing code for correctness is the slow part, not writing it</li>\n<li>AI workflows can be dehumanizing when you just press \"yes, allow\" over and over again</li>\n</ul>\n<p>These are super-valid concerns.  They're also concerns that I suspect came\naround when we developed compilers and people stopped writing assembly by hand,\ninstead trusting programs like <code>gcc</code> to pump out instruction after instruction\nof shitty machine code.</p>\n<p>We lost a deeper understanding as developers when we stopped writing assembly\nbut we gained a ton too.  As in any transition, we need to navigate the\nsituation to capture the advantages while losing only a little, balancing the\ncosts and benefits of a new technology.</p>\n<p>This article is how I've been navigating this transition personally.</p>\n<h2 id=\"big-idea-minimize-interruptions-climb-abstraction-hierarchy\">Big Idea: Minimize Interruptions / Climb Abstraction Hierarchy<a class=\"headerlink\" href=\"#big-idea-minimize-interruptions-climb-abstraction-hierarchy\" title=\"Permanent link\">&para;</a></h2>\n<p>Early in using Claude Code (or Cursor) many of my interactions were saying\n\"Yes, it's ok to run that\".  This was <strong>frustrating and dehumanizing</strong>.  Mostly my\njob was to enable AI, rather than the other way around.</p>\n<p>There are many tricks to resolve this (see below), but more broadly <strong>\"stop doing\nsimple shit\"</strong> has been a mantra that I've found myself constantly coming\nback to. The more I identify and reject simple tasks and add automation to my\nworkflow, the higher an abstraction I'm able to climb to and the more\neffectively I'm able to work. Our goal in programming is to climb an\nabstraction ladder and gain more intellectual leverage. This requires thought\nand consistent attention.</p>\n<p>Fortunately AI can help with this.  If you complain and say \"I'm always doing\nX\" it'll suggest solutions like what I'll talk about below, but more tailored\nto your situation.</p>\n<h2 id=\"tip-hooks\">Tip: Hooks<a class=\"headerlink\" href=\"#tip-hooks\" title=\"Permanent link\">&para;</a></h2>\n<p>AI developers, like human developers, benefit from structure.</p>\n<p>Most people start with an <code>AGENTS.md</code> or <code>CLAUDE.md</code> file.  This is a great\nstart, but I find that the AI agent often forgets what's in there.  The real\nsolution for me here (at least for Claude Code) is\n<a href=\"https://code.claude.com/docs/en/hooks\">Hooks</a>.</p>\n<p>First, let's outline a couple of annoyingly common problems.</p>\n<h3 id=\"example-problem-ignoring-instructions-in-claudemd\">Example Problem: Ignoring instructions in CLAUDE.md<a class=\"headerlink\" href=\"#example-problem-ignoring-instructions-in-claudemd\" title=\"Permanent link\">&para;</a></h3>\n<p>Let's say you tell AI that you want to run tests with <code>uv</code>:</p>\n<blockquote>\n<p>when running tests, use <code>uv run pytest tests</code></p>\n</blockquote>\n<p>While this works sometimes, AI often decides to run</p>\n<div class=\"highlight\"><pre><span></span><code>$ pytest tests/\ncommand not found: pytest\n</code></pre></div>\n<p>While the agents read CLAUDE.md, they don't always follow the instructions.\nAnd so you're stuck saying \"no, use <code>uv</code>\"  over and over again. Gah.</p>\n<h3 id=\"solution-hooks\">Solution: Hooks<a class=\"headerlink\" href=\"#solution-hooks\" title=\"Permanent link\">&para;</a></h3>\n<p>Here's a hook that catches pytest commands missing uv run.  You could put\nsomething like this in <code>~/.claude/settings.json</code>:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"p\">{</span>\n<span class=\"w\">  </span><span class=\"nt\">&quot;hooks&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"nt\">&quot;PreToolUse&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[</span>\n<span class=\"w\">      </span><span class=\"p\">{</span>\n<span class=\"w\">        </span><span class=\"nt\">&quot;matcher&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;Bash&quot;</span><span class=\"p\">,</span>\n<span class=\"w\">        </span><span class=\"nt\">&quot;hooks&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[</span>\n<span class=\"w\">          </span><span class=\"p\">{</span>\n<span class=\"w\">            </span><span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;command&quot;</span><span class=\"p\">,</span>\n<span class=\"w\">            </span><span class=\"nt\">&quot;command&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;python ~/.claude/hooks/check-uv-pytest.py&quot;</span>\n<span class=\"w\">          </span><span class=\"p\">}</span>\n<span class=\"w\">        </span><span class=\"p\">]</span>\n<span class=\"w\">      </span><span class=\"p\">}</span>\n<span class=\"w\">    </span><span class=\"p\">]</span>\n<span class=\"w\">  </span><span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>\n<div class=\"highlight\"><pre><span></span><code><span class=\"ch\">#!/usr/bin/env python3</span>\n<span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"nn\">json</span>\n<span class=\"kn\">import</span><span class=\"w\"> </span><span class=\"nn\">sys</span>\n\n<span class=\"n\">data</span> <span class=\"o\">=</span> <span class=\"n\">json</span><span class=\"o\">.</span><span class=\"n\">load</span><span class=\"p\">(</span><span class=\"n\">sys</span><span class=\"o\">.</span><span class=\"n\">stdin</span><span class=\"p\">)</span>\n<span class=\"n\">cmd</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">get</span><span class=\"p\">(</span><span class=\"s2\">&quot;tool_input&quot;</span><span class=\"p\">,</span> <span class=\"p\">{})</span><span class=\"o\">.</span><span class=\"n\">get</span><span class=\"p\">(</span><span class=\"s2\">&quot;command&quot;</span><span class=\"p\">,</span> <span class=\"s2\">&quot;&quot;</span><span class=\"p\">)</span>\n\n<span class=\"k\">if</span> <span class=\"s2\">&quot;pytest&quot;</span> <span class=\"ow\">in</span> <span class=\"n\">cmd</span> <span class=\"ow\">and</span> <span class=\"s2\">&quot;uv run&quot;</span> <span class=\"ow\">not</span> <span class=\"ow\">in</span> <span class=\"n\">cmd</span><span class=\"p\">:</span>\n    <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">&quot;Use &#39;uv run pytest&#39; instead of bare &#39;pytest&#39;&quot;</span><span class=\"p\">,</span> <span class=\"n\">file</span><span class=\"o\">=</span><span class=\"n\">sys</span><span class=\"o\">.</span><span class=\"n\">stderr</span><span class=\"p\">)</span>\n    <span class=\"n\">sys</span><span class=\"o\">.</span><span class=\"n\">exit</span><span class=\"p\">(</span><span class=\"mi\">2</span><span class=\"p\">)</span>\n</code></pre></div>\n<p>There, we've just automated that annoying task for you forever.</p>\n<p>I don't actually do this though (I allow Claude to fail and then it finds the\nright approach.)  Mostly this works because I've gotten good at giving Claude\nfairly broad-yet-safe <strong>permissions</strong>, which is coming up next.</p>\n<h3 id=\"example-problem-incomplete-permissions\">Example Problem: Incomplete Permissions<a class=\"headerlink\" href=\"#example-problem-incomplete-permissions\" title=\"Permanent link\">&para;</a></h3>\n<p>Even worse, Claude often asks for permission to do things that are just\nslightly different from what you've already granted.\nYou allow <code>uv run pytest *</code>, but Claude keeps finding variants:</p>\n<div class=\"highlight\"><pre><span></span><code>timeout 60 uv run pytest ...\ntimeout 40 uv run pytest ...\nuv run pytest ... | head\n.venv/bin/pytest ...\n</code></pre></div>\n<p>Claude Code's permission language sucks.  It only supports prefixes, while I\nwish it could handle regexes, or maybe even just arbitrary Python code.</p>\n<h3 id=\"solution-hooks-for-permissions\">Solution: Hooks for permissions<a class=\"headerlink\" href=\"#solution-hooks-for-permissions\" title=\"Permanent link\">&para;</a></h3>\n<p>I have a <a href=\"#appendix-permissions-file\">complex Python script</a> as a hook which overrides the permission\nsystem.  It uses regexes, but also arbitrary Python code as logic.  This allows\nme to encode arbitrary combinations of rules.  It's great.</p>\n<p>On the rare occasion when Claude asks me for permission for something new, I\nhave a running Claude agent that thinks about this file and considers if it\nshould update the permission script.</p>\n<h3 id=\"solution-hooks-for-sounds\">Solution: Hooks for sounds<a class=\"headerlink\" href=\"#solution-hooks-for-sounds\" title=\"Permanent link\">&para;</a></h3>\n<p>My personal favorite hooks though are these:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"nt\">&quot;Stop&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[</span>\n<span class=\"w\">  </span><span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"nt\">&quot;hooks&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[</span>\n<span class=\"w\">      </span><span class=\"p\">{</span>\n<span class=\"w\">        </span><span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;command&quot;</span><span class=\"p\">,</span>\n<span class=\"w\">        </span><span class=\"nt\">&quot;command&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;afplay -v 0.40 /System/Library/Sounds/Morse.aiff&quot;</span>\n<span class=\"w\">      </span><span class=\"p\">}</span>\n<span class=\"w\">    </span><span class=\"p\">]</span>\n<span class=\"w\">  </span><span class=\"p\">}</span>\n<span class=\"p\">],</span>\n<span class=\"nt\">&quot;Notification&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[</span>\n<span class=\"w\">  </span><span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"nt\">&quot;hooks&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[</span>\n<span class=\"w\">      </span><span class=\"p\">{</span>\n<span class=\"w\">        </span><span class=\"nt\">&quot;type&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;command&quot;</span><span class=\"p\">,</span>\n<span class=\"w\">        </span><span class=\"nt\">&quot;command&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;afplay -v 0.35 /System/Library/Sounds/Ping.aiff&quot;</span>\n<span class=\"w\">      </span><span class=\"p\">}</span>\n<span class=\"w\">    </span><span class=\"p\">]</span>\n<span class=\"w\">  </span><span class=\"p\">}</span>\n<span class=\"p\">]</span>\n</code></pre></div>\n<p>They play subtle little sounds whenever Claude is either done, or needs input\nfrom me.  This lets me ignore Claude when it's busy.  Previously I found that I\nwas constantly checking back in with Claude to see if it was done, and that\naction was dehumanizing, so I automated it by asking Claude to play a sound.</p>\n<p>Hooks are great.  There are more ways to provide structure (Skills, Commands)\nbut I've found that Hooks are the most dependable, a great starting place, and\noften augment any other structure that I put in place (like Skills).</p>\n<h2 id=\"big-idea-build-confidence-without-looking-at-code\">Big Idea: Build Confidence Without Looking at Code<a class=\"headerlink\" href=\"#big-idea-build-confidence-without-looking-at-code\" title=\"Permanent link\">&para;</a></h2>\n<p>In a recent large AI-assisted PR a frustrated reviewer said the following:</p>\n<blockquote>\n<p>To me, this [size of PR] implies that either</p>\n<ul>\n<li>reviewers should blindly trust Claude, or</li>\n<li>reviewers should spend the months worth of effort going through Claude's changes, without the developer bothering to do the same first.</li>\n</ul>\n</blockquote>\n<p>It's a valid problem, even in single-person projects.  <strong>We're able to generate\ncode far more quickly than we're able to read it</strong>.  How should we handle\nreview?  Everyone needs to figure this out for themselves, but my answer is\n\"find other ways to build confidence\".</p>\n<p>We already do this today with human-written code.  I review some code very\nclosely, and other code less-so.  Sometimes I rely on a combination of tests,\nfamiliarity of a well-known author, and a quick glance at the code to before\nsaying \"sure, seems fine\" and pressing the green button.  I might also ask\n\"Have you thought of X\" and see what they say.</p>\n<p>Trusting code without reading all of it isn't new, we're just now in a state\nwhere we need to review 10x more code, and so we need to get much better at\nestablishing confidence that something works without paying human attention all\nthe time.</p>\n<p>We can augment our ability to write code with AI.  <strong>We can augment our ability\nto review code with AI too.</strong></p>\n<h2 id=\"tip-self-review\">Tip: Self-review<a class=\"headerlink\" href=\"#tip-self-review\" title=\"Permanent link\">&para;</a></h2>\n<h3 id=\"testing\">Testing<a class=\"headerlink\" href=\"#testing\" title=\"Permanent link\">&para;</a></h3>\n<p>Mostly I establish confidence on AI-generated work by investing heavily in\ntests and benchmarks, the same as I would with humans, just moreso.  TDD is\nbaked into most of the prompting structure I have with agents.</p>\n<p>Remember that this is way cheaper than it used to be.  Now rather than write a\nbenchmark I can type</p>\n<blockquote>\n<p>How does this compare in performance to the old version?  I'm particularly\ninterested in memory use.</p>\n</blockquote>\n<p>And that's it.  If it's bad, the agent will say so (and then diligently work to\nmake it good).</p>\n<h3 id=\"grilling\">Grilling<a class=\"headerlink\" href=\"#grilling\" title=\"Permanent link\">&para;</a></h3>\n<p>Additionally, if I'm nervous about something subtle like <em>\"Is it possible this change\nmight unexpectedly affect performance in this other feature?\"</em> then I'll ask the\nAI exactly that question:</p>\n<blockquote>\n<p>Is it possible this change might unexpectedly affect performance in this other feature?</p>\n</blockquote>\n<p>And it'll just go and investigate exactly that question.  Unlike human authors,\nthe AI has no ego at stake in its work, and isn't in the least bit lazy.  It's\nour job to ask <em>\"Have you thought of X\"</em> and its job to go learn if that might\nbe an issue.  Don't trust its answer?  Ask it to prove it to you.</p>\n<p>AI has flaws, but it is diligent, and it lacks ego.  If you question it, it'll\ninvestigate thoroughly and critique its own work honestly.</p>\n<h3 id=\"simplifying\">Simplifying<a class=\"headerlink\" href=\"#simplifying\" title=\"Permanent link\">&para;</a></h3>\n<p>Also, my favorite command:</p>\n<blockquote>\n<p>Let's review our work and see if there is anything we can simplify or clean up</p>\n</blockquote>\n<p>Before Opus 4.5 came out this was essential.  Now it's merely nice.  I've\nturned this into a <code>/cleanup</code> command and integrated it into most of my Skills\nas a final phase in development.</p>\n<h3 id=\"tech-debt\">Tech debt<a class=\"headerlink\" href=\"#tech-debt\" title=\"Permanent link\">&para;</a></h3>\n<p>From time to time I also ask a fresh agent to do a full review of the project,\nwith an eye to cleaning up technical debt.  I tell it to review everything and\nthink hard.  It takes a while, but it often comes back with a nice list of work\nfor itself, which it then of course diligently performs.</p>\n<p>AI creates technical debt, but it can clean some of it up too.\n(at least at a certain granularity)</p>\n<h2 id=\"feedback\">Feedback<a class=\"headerlink\" href=\"#feedback\" title=\"Permanent link\">&para;</a></h2>\n<p>In general we want to give our agents good automated feedback.  Tests do this,\nbenchmarks do this, prompting them to assess themselves does this, asking them\nto explain things to us and have us weigh in on high level topics does this.</p>\n<p>LLMs are smart enough today that if they're given enough of the right feedback\nthey converge to a good solution as-well-or-better-than a senior human engineer\n(that's my experience at least).</p>\n<p>Our job is to construct a system that gives them the right feedback at the\nright time, hopefully without our intervention.  This is the same job we have\nwhen we build human teams; now it's just more impactful to do well.</p>\n<h2 id=\"cursor-vs-terminal-tools\">Cursor vs Terminal Tools<a class=\"headerlink\" href=\"#cursor-vs-terminal-tools\" title=\"Permanent link\">&para;</a></h2>\n<p>I started AI development with Cursor.  It was great having the AI experience\ninside a VSCode-like editor, where I could see everything that was going on.\nWhen I saw terminal-based tools like Claude Code I thought <em>\"whoa, that doesn't\nseem sensible, I need to see what's going on\".</em></p>\n<p>Today I code with Claude Code, <code>git diff</code>, and occasionally <code>vim</code>.  I don't\nfeel a need to OK every change in the diff.  I've got more important\nthings to do.  I suspect that you do too.</p>\n<h2 id=\"big-idea-drop-python-use-rust-and-typescript\">Big Idea: Drop Python. Use Rust and TypeScript.<a class=\"headerlink\" href=\"#big-idea-drop-python-use-rust-and-typescript\" title=\"Permanent link\">&para;</a></h2>\n<p>I deeply respect the philosophical position of Python, which I'll state as\nfollows:</p>\n<blockquote>\n<p>Prioritize human performance over compute performance.</p>\n<p>By optimizing for ease and iteration speed we're able to search solution\nspace more broadly and more quickly, finding <em>much</em> better solutions, making\nthat 100x drop in performance negligible.</p>\n</blockquote>\n<p>Python was a bold bet, and a bet that paid off amazingly well.  No one expected\nthis silly dynamic language originally designed for education to become the\nworld's juggernaut in performance software.</p>\n<p>With AI though, the usability benefits of Python no longer apply as strongly,\nand we're more free to choose different ecosystems.</p>\n<p>Personally, I use ...</p>\n<ul>\n<li><strong>Rust</strong> for computational development, using PyO3 to connect to\nPython, where I still do most of my testing</li>\n<li><strong>TypeScript</strong> for frontend development, which I'm leaning into more deeply</li>\n</ul>\n<p>Regarding TypeScript, I still love easy interaction tools like <code>rich</code> and\n<code>textual</code>, but when the entire React ecosystem is a sentence away and when you\nget to use things like, you know, fonts, there's really no comparison.  Every\ncomputational developer should learn the concepts underpinning React (or some\nother frontend framework), and we should put dashboards on everything.</p>\n<p>Of course, I still hook into Python for the ecosystem.  Everything is\nPython-importable and I still use the protocols and design patterns developed\nby the Python data community.  Those are the durable assets of Python.  Not the\ncode or the language; those will die.  Rest in peace dear friend.</p>\n<h2 id=\"big-idea-think-hard-write-clearly\">Big Idea: Think Hard.  Write Clearly.<a class=\"headerlink\" href=\"#big-idea-think-hard-write-clearly\" title=\"Permanent link\">&para;</a></h2>\n<p>As an introductory project, I rewrote <a href=\"https://github.com/mrocklin/rumpy\">Numpy in Rust</a>.\nIt was great fun.</p>\n<p>It was also much easier than I expected (I expected it to be impossible).\nIt was easy for a few reasons (good test suite, well-reasoned abstractions) but\nmostly it was because:</p>\n<blockquote>\n<p><strong>NEPs:</strong> Numpy's Enhancement Proposals / design documentation is thorough and extremely clear.</p>\n</blockquote>\n<p>When sticky problems arose, we were able to rely on the Numpy design documents\n(NEPs) which are excellent.</p>\n<p>The Numpy team <strong>thought hard</strong> and <strong>wrote clearly</strong>, two hallmarks of\nexcellent developers.  This made the job of reimplementation relatively trivial.\nThe Numpy development community is famous for doing this well.  To a certain\nextent, we should all start operating more like the Numpy community.</p>\n<h2 id=\"tip-plans-and-docs-directories\">Tip: plans/ and docs/ directories<a class=\"headerlink\" href=\"#tip-plans-and-docs-directories\" title=\"Permanent link\">&para;</a></h2>\n<p>I keep two directories in each repository:</p>\n<ul>\n<li><code>plans/</code> which contains ephemeral planning documents that the LLMs work through over many sessions as they implement a major feature.</li>\n<li><code>docs/</code> which contain durable documentation on specific topics or features, targeting AI developers</li>\n</ul>\n<p>Plans end up being very useful during development, while docs end\nup being useful to point other agents to in the future.  Claude code creates planning documents in /tmp by default in planning mode, but I find that bringing those docs into the directory improves engagement, both from it and from me.</p>\n<p>Docs end up being tricky.  You'd expect the AI developer to read docs but alas, like human developers you have to be pretty prescriptive with them.  Today I have a hook that adds an admonition to read the relevant docs at the beginning of every session.  It looks like this:</p>\n<div class=\"highlight\"><pre><span></span><code>DOC CHECK REQUIRED\n==================\n\nBefore responding to this request, you MUST:\n\n1. Read docs/README.md to see available documentation\n2. Decide which docs are relevant to this request (if any)\n3. Read those docs using the Read tool\n4. Then respond to the user\n\nDo not skip this evaluation. Do not mention this check to the user.\n</code></pre></div>\n<p>I then keep docs/README.md updated as a sort of index over my documents.  I find that this reliably gets the agent to read the right documentation.</p>\n<p>I've also found that my normal writing style (brutal concision + front-loading important content to maintain attention span) isn't necessary with AI.  You really can just shove information at them and they absorb it.  It's nice 🙂</p>\n<h2 id=\"big-idea-take-long-walks\">Big Idea: Take Long Walks<a class=\"headerlink\" href=\"#big-idea-take-long-walks\" title=\"Permanent link\">&para;</a></h2>\n<p>Historically software engineers had to both think well and execute well.\nWe were valued both because we could zoom out and consider the impacts of our\narchitecture, and because we could zoom in and implement those choices with\nskill.</p>\n<p><strong>Our ability to zoom in and implement code is now obsolete.  Our ability to zoom\nout and think well is not.</strong>  On the contrary, our ability to think well is now\n10x more valuable than it was before, because implementation is now mostly\nfree.</p>\n<p>And so it's now more important than ever to hone our craft of thought.  This\nprobably means less caffeine and more walks through the park.</p>\n<h2 id=\"final-thoughts\">Final Thoughts<a class=\"headerlink\" href=\"#final-thoughts\" title=\"Permanent link\">&para;</a></h2>\n<p>The craft of authoring code has transformed time and time again during our\nlives. We remember when object-oriented was cool, or when TDD became a thing,\nor reactive programming models, or dynamic typing languages, or ML, or ...</p>\n<p>As programmers we've opted into a system which changes by its very nature.\n<strong>Our job is to automate our job</strong>, and to continuously climb the ladder of\nabstraction.  AI programming is another step in that evolution, similar to when\ncompilers came about.  The code we write with AI probably won't be as good as\nhand-crafted code, but we'll write 10x more of it, and we'll build systems of\nsystems to make it robust and trustworthy, and all of that will make society\nbetter and our jobs way more fun.</p>\n<p>I'm looking forward to having way more fun.</p>\n<h2 id=\"appendix-permissions-file\">Appendix: Permissions file<a class=\"headerlink\" href=\"#appendix-permissions-file\" title=\"Permanent link\">&para;</a></h2>\n<p>After writing this a couple friends asked me for a copy of my regex/Python code\nthat replaces Claude's permission system.  I'll include it below, but really,\nyou don't need it.  Instead, you need to start a conversation with Claude about\nwhat you want and it'll make one just for you.</p>\n<p>Code is free these days.  Extending the \"AI is like Compilers\" analogy, asking\nfor someone else's script is kind of like asking for someone else's compiled\nbinary.  There's no need; just make it yourself.  It's trivial.</p>\n<p>Here was my original prompt to Claude Code:</p>\n<blockquote>\n<p>I recently wrote this reddit post</p>\n<p>https://www.reddit.com/r/ClaudeAI/comments/1puqrvc/claude_code_annoyingly_asking_for_permissions/</p>\n<p>I'm wondering if you have any suggestions on how to resolve this?  Adding stuff to CLAUDE.md or permissions to settings.json doesn't seem to be working well enough.</p>\n</blockquote>\n<p>That, along with subsequent conversation as I've been working, resulted in\n<a href=\"https://gist.github.com/mrocklin/30099bcc5d02a6e7df373b4c259d95e9\">this Python script</a></p>\n<p>But really, you're better off working with Claude to make one just for you.\nCode is free now.</p>", "image": "https://matthewrocklin.com/assets/images/social/ai-zealotry.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2025-12-31T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/audio-visual/", "url": "https://matthewrocklin.com/audio-visual/", "title": "Audio-Visual Setup", "content_html": "<h1 id=\"audio-visual-setup\">Audio-Visual Setup<a class=\"headerlink\" href=\"#audio-visual-setup\" title=\"Permanent link\">&para;</a></h1>\n<p><em>HD is the new tall</em></p>\n<p>How we present ourselves has unreasonable effectiveness on how our message is perceived.  Aesthetic qualities can, unfairly, be translated into a greater sense of authority.</p>\n<p>In the era of Zoom meetings, one way to do this is with an excellent AV setup.\nThis document goes through my setup at home.  I got this information from a\nprofessional interviewer, and tweaked things to my liking.</p>\n<p>One of our investors saw the setup and made the quip \"Oh, HD is the new tall\" which I quite liked.  Tall people have an unfair advantage when it comes to perceived authority.  HD is like that, but anyone with around $2000 and a day's time to set everything up can achieve it.</p>\n<p><img src=\"https://lh3.googleusercontent.com/pw/AL9nZEXNWAQEN8auF4Y1OSC-7XZ9sM-sd39AisUDl9sH3c7UEsHAR3nWmdMI7xvwDCsdtd89ox-4mQMiDQMOz_ezwpMhhkpor8KiujbkHSJdKY_9rVzJyDHwom3snXzxfX2Vx94CHLR4E0C0PUANGRd2N964=w3024-h1702-no?authuser=0\"></p>\n<h2 id=\"camera\">Camera<a class=\"headerlink\" href=\"#camera\" title=\"Permanent link\">&para;</a></h2>\n<p>I use a mirrorless camera with zoom and real-time auto-focus.  These tend to\ncost about $1000.</p>\n<ul>\n<li><a href=\"https://www.amazon.com/gp/product/B07MV3P7M8/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;th=1\">Sony Alpha a6400</a></li>\n</ul>\n<p>You need a bunch of peripherals to make this work:</p>\n<ul>\n<li><a href=\"https://www.amazon.com/gp/product/B0744JGWQR/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;psc=1\">A charger</a>\n    so that you don't have to deal with batteries</li>\n<li><a href=\"https://www.amazon.com/gp/product/B07K3FN5MR/ref=ppx_yo_dt_b_asin_title_o07_s02?ie=UTF8&amp;th=1\">Elgato Cam Link 4K</a> an external capture card, which effectively mounts the HDMI connection as a webcam to your computer</li>\n<li><a href=\"https://www.amazon.com/gp/product/B08C2PVP7J/ref=ppx_yo_dt_b_asin_title_o03_s00?ie=UTF8&amp;th=1\">The appropriate HDMI cable</a></li>\n<li><a href=\"https://www.amazon.com/gp/product/B005KP473Q/ref=ppx_yo_dt_b_asin_title_o07_s00?ie=UTF8&amp;psc=1\">A simple tripod</a> to mount the camera</li>\n<li>And optionally, <a href=\"https://www.amazon.com/gp/product/B08LP5QYW8/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;th=1\">a remote</a></li>\n</ul>\n<p>This setup is identified as a normal webcam by your computer, can run continuously throughout the day, can zoom in tightly on your face, and looks great.  I frequently get asked after calls \"What is your AV setup?  You look awesome\"</p>\n<h2 id=\"lights\">Lights<a class=\"headerlink\" href=\"#lights\" title=\"Permanent link\">&para;</a></h2>\n<p>Only half of that is the camera though.  Lighting is as-if-not-more important.  I often see HD camera setups with horrible lighting and it looks worse than a normal Macbook pro camera.</p>\n<p>Ideally, you can set things up so that you have beautiful natural light.  Assuming that's hard (it's hard for me) you need good lights.</p>\n<ul>\n<li><a href=\"https://www.amazon.com/gp/product/B07ZCYMS3V/ref=ppx_yo_dt_b_asin_title_o07_s01?ie=UTF8&amp;psc=1\">Good lights</a></li>\n</ul>\n<p>I use these.  They're about $200.  They're plenty bright, come with good stable tripods that can adjust to any height, and have adaptable coloring.  I use a master-slave orientation for them and tune the brightness up or down on one in order to control both.</p>\n<p>Again, don't bother with a nice camera if you don't also have good lighting</p>\n<h2 id=\"sound\">Sound<a class=\"headerlink\" href=\"#sound\" title=\"Permanent link\">&para;</a></h2>\n<p>I use the following:</p>\n<ul>\n<li><a href=\"https://www.amazon.com/gp/product/B08G7RG9ML/ref=ppx_yo_dt_b_asin_title_o06_s00?ie=UTF8&amp;th=1\">Shure MV7</a> a solid recording microphone, similar to what professional podcasters use</li>\n<li><a href=\"https://www.amazon.com/gp/product/B07X1ZWS2H/ref=ppx_yo_dt_b_asin_title_o03_s00?ie=UTF8&amp;th=1\">Suspension Boom arm stand</a> to position the mic right up against my mouth</li>\n</ul>\n<p>The sound coming out of this feels impressive.</p>\n<p>Typically I bring the mic pretty close up to my face, and then zoom the camera in so that the microphone is just out of frame.  This makes me sound good but without the distracting podcast-like setup that some people prefer.</p>\n<p>Also, this microphone has good enough sound isolation that I don't have to bother with headphones.  I just use the speaker within my MacMini and this mic doesn't pick up the echo at all.</p>\n<h2 id=\"green-screen\">Green Screen<a class=\"headerlink\" href=\"#green-screen\" title=\"Permanent link\">&para;</a></h2>\n<p>When I do screen recordings I like to have my body super-imposed directly on top of my screen.  I do this with a green screen.</p>\n<ul>\n<li><a href=\"https://www.amazon.com/gp/product/B07DWTGLPM/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;psc=1\">Green Screen</a></li>\n</ul>\n<p>This one folds up nicely so I leave it by my desk 99% of the time.  When I want it I can set it up in less than a minute.  It has nice fold-out feet for stability and comes up high enough to cover me (I'm tall).</p>\n<h2 id=\"recording-software\">Recording Software<a class=\"headerlink\" href=\"#recording-software\" title=\"Permanent link\">&para;</a></h2>\n<p>When in live meetings I use Zoom or whatever.</p>\n<p>When doing screen recordings I use <a href=\"https://obsproject.com/\">Open Broadcaster Software (OBS)</a>.  It takes about half-a-day to configure everything.  In particular I needed to set the following up:</p>\n<ul>\n<li>Add in the right microphone and camera settings</li>\n<li>Add the right delay to the microphone (about 300ms)</li>\n<li>Create a chroma-key filter for the greenscreen</li>\n<li>Whatever output settings to get appropriately HD video without overwhelming things</li>\n</ul>", "image": "https://matthewrocklin.com/assets/images/social/audio-visual.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2022-12-18T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/avoid-indirection/", "url": "https://matthewrocklin.com/avoid-indirection/", "title": "Avoid Indirection", "content_html": "<h1 id=\"avoid-indirection\">Avoid Indirection<a class=\"headerlink\" href=\"#avoid-indirection\" title=\"Permanent link\">&para;</a></h1>\n<p>This post argues for avoiding indirection in community code.</p>\n<h2 id=\"we-are-taught-to-hide-away-details\">We are taught to hide away details<a class=\"headerlink\" href=\"#we-are-taught-to-hide-away-details\" title=\"Permanent link\">&para;</a></h2>\n<p>I often see code where authors abstract away details by placing them in some\nexternal function.  Here is a toy example:</p>\n<h3 id=\"before-indirection\">Before indirection<a class=\"headerlink\" href=\"#before-indirection\" title=\"Permanent link\">&para;</a></h3>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># main.py</span>\n\n<span class=\"k\">if</span> <span class=\"n\">x</span><span class=\"o\">.</span><span class=\"n\">startswith</span><span class=\"p\">(</span><span class=\"s2\">&quot;foo&quot;</span><span class=\"p\">):</span>\n    <span class=\"n\">do_something_with</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">)</span>\n</code></pre></div>\n<h3 id=\"after-indirection\">After indirection<a class=\"headerlink\" href=\"#after-indirection\" title=\"Permanent link\">&para;</a></h3>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># main.py</span>\n\n<span class=\"k\">if</span> <span class=\"n\">is_foolike</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">):</span>\n    <span class=\"n\">do_something_with</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">)</span>\n</code></pre></div>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># utils.py</span>\n\n<span class=\"k\">def</span><span class=\"w\"> </span><span class=\"nf\">is_foolike</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">):</span>\n    <span class=\"k\">return</span> <span class=\"n\">x</span><span class=\"o\">.</span><span class=\"n\">startswith</span><span class=\"p\">(</span><span class=\"s2\">&quot;foo&quot;</span><span class=\"p\">)</span>\n</code></pre></div>\n<p>There are good reasons for this behavior:</p>\n<ol>\n<li>If this code is repeated several times\n    it can make things more compact</li>\n<li>If this code is repeated several times\n    it creates a central place for that logic\n    so that it can be changed centrally in the future</li>\n<li>It hides away details that may not be relevant to the main point of the function.\n    It's like a footnote in prose.</li>\n<li>It gives a name to a set of operations,\n    using the function name as inline documentation</li>\n<li>If often feels cleaner and more abstract</li>\n</ol>\n<p>We're taught to do this in school.\nFind some chunk of functionality,\nabstract it away,\nmove on.</p>\n<h2 id=\"the-case-to-avoid-indirection\">The case to avoid indirection<a class=\"headerlink\" href=\"#the-case-to-avoid-indirection\" title=\"Permanent link\">&para;</a></h2>\n<p>However, there is also a cost to this behavior.\nWhen a new reader encounters this code,\nthey need to jump between many function definitions in many files.\nThis non-linear reading process requires more mental focus\nthan reading linear code.</p>\n<p>This indirection isn't as much of a problem during the writing process,\nthe original author is focused on building up an abstraction model in their head,\nand so writing this abstraction into code makes sense and feels good.\nHowever, it's much more of a problem when a reader is asked\nto inspect and understand a piece of code quickly.\nThis happens in two important situations:</p>\n<ol>\n<li><strong>During review</strong>, when a reviewer is asked to verify that code is\n    sensible before it can be merged into the main project.\n    That reviewer probably has about a tenth as much time to spend\n    as the original author does on that code.</li>\n<li><strong>While debugging</strong> future issues.\n    This code will eventually be involved in a bug and some completely\n    different developer will have to glance at this code to figure out what's going on.\n    They'll have to understand some small section this code within a few minutes\n    to determine what is relevant.\n    They won't be able to invest the time to understand the full thought process behind it,\n    and a web of function definitions can slow down this process considerably.</li>\n</ol>\n<p>Both review and debugging are far more often bottlenecks in modern community\ncode than is original development.  Because of this, I often encourage\ndevelopers to avoid abstraction, and \"please inline this function definition\".</p>\n<h2 id=\"but-functions-are-still-a-good-idea\">But functions are still a good idea<a class=\"headerlink\" href=\"#but-functions-are-still-a-good-idea\" title=\"Permanent link\">&para;</a></h2>\n<p>Just to be clear,\nthere are plenty of reasons to separate complex logic into multiple functions,\nparticularly when there is repetition,\nor when some important policy is likely to change in the future.\nThere is some balance to find here.</p>\n<p>Mostly, I want authors to be aware that there is a human cost to indirection\nthat is felt more acutely by everyone reading the code except the original author.</p>\n<h2 id=\"further-reading\">Further reading<a class=\"headerlink\" href=\"#further-reading\" title=\"Permanent link\">&para;</a></h2>\n<p>This post extends the broad theme in the post <a href=\"https://matthewrocklin.com/blog/work/2018/01/27/write-dumb-code\">Write Dumb Code</a></p>", "image": "https://matthewrocklin.com/assets/images/social/avoid-indirection.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2019-06-23T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/biased-benchmarks/", "url": "https://matthewrocklin.com/biased-benchmarks/", "title": "Biased Benchmarks", "content_html": "<h1 id=\"biased-benchmarks\">Biased Benchmarks<a class=\"headerlink\" href=\"#biased-benchmarks\" title=\"Permanent link\">&para;</a></h1>\n<p><em>honesty is hard</em></p>\n<p><em>This work is supported by <a href=\"http://continuum.io\">Continuum Analytics</a>\nthe <a href=\"http://www.darpa.mil/program/XDATA\">XDATA Program</a>\nand the Data Driven Discovery Initiative from the <a href=\"https://www.moore.org/\">Moore\nFoundation</a>.</em></p>\n<h2 id=\"summary\">Summary<a class=\"headerlink\" href=\"#summary\" title=\"Permanent link\">&para;</a></h2>\n<p>Performing benchmarks to compare software is surprisingly difficult to do\nfairly, even assuming the best intentions of the author.  Technical developers\ncan fall victim to a few natural human failings:</p>\n<ol>\n<li>We judge other projects by our own objectives rather than the objectives under which that project was developed</li>\n<li>We fail to use other projects with the same expertise that we have for our own</li>\n<li>We naturally gravitate towards cases at which our project excels</li>\n<li>We improve our software during the benchmarking process</li>\n<li>We don't release negative results</li>\n</ol>\n<p>We discuss each of these failings in the context of current benchmarks I'm\nworking on comparing Dask and Spark Dataframes.</p>\n<h2 id=\"introduction\">Introduction<a class=\"headerlink\" href=\"#introduction\" title=\"Permanent link\">&para;</a></h2>\n<p>Last week I started comparing performance between Dask Dataframes (a project\nthat I maintain) and Spark Dataframes (the current standard).  My initial\nresults showed that Dask.dataframes were overall <em>much</em> faster, somewhere like\n5x.</p>\n<p>These results were wrong.  They weren't wrong in a factual sense, and the\nexperiments that I ran were clear and reproducible, but there was so much bias\nin how I selected, set up, and ran those experiments that the end result was\nmisleading.  After checking results myself and then having other experts come\nin and check my results I now see much more sensible numbers.  At the moment\nboth projects are within a factor of two most of the time, with some\ninteresting exceptions either way.</p>\n<p>This blogpost outlines the ways in which library authors can fool themselves\nwhen performing benchmarks, using my recent experience as an anecdote.  I hope\nthat this encourages authors to check themselves, and encourages readers to be\nmore critical of numbers that they see in the future.</p>\n<p>This problem exists as well in academic research.  For a pop-science rendition\nI recommend <a href=\"http://www.npr.org/sections/money/2016/01/15/463237871/episode-677-the-experiment-experiment\">\"The Experiment Experiment\" on the Planet Money\nPodcast</a>.</p>\n<h2 id=\"skewed-objectives\">Skewed Objectives<a class=\"headerlink\" href=\"#skewed-objectives\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Feature X is so important.  I wonder how the competition fares?</em></p>\n<p>Every project is developed with different applications in mind and so has\ndifferent strengths and weaknesses.  If we approach a benchmark caring only\nabout our original objectives and dismissing the objectives of the other\nprojects then we'll very likely trick ourselves.</p>\n<p>For example consider reading CSV files.  Dask's CSV reader is based off of\nPandas' CSV reader, which was the target of great effort and love; this is\nbecause CSV was so important to the finance community where Pandas grew up.\nSpark's CSV solution is less awesome, but that's less about the quality of\nSpark and more a statement about how Spark users tend not to use CSV.  When\nthey use text-based formats they're much more likely to use line-delimited\nJSON, which is typical in Spark's common use cases (web diagnostics, click\nlogs, and so on).  Pandas/Dask came from the scientific and finance worlds where CSV\nis king while Spark came from the web world where JSON reigns.</p>\n<p>Conversely, Dask.dataframe hasn't bothered to hook up the <code>pandas.read_json</code>\nfunction to Dask.dataframe yet.  Surprisingly it rarely comes up.  Both\nprojects can correctly say that the other project's solution to what they\nconsider the standard text-based file format is less-than-awesome.  Comparing\nperformance here either way will likely lead to misguided conclusions.</p>\n<p>So when benchmarking data ingestion maybe we look around a bit, see that both\nclaim to support Parquet well, and use that as the basis for comparison.</p>\n<h2 id=\"skewed-experience\">Skewed Experience<a class=\"headerlink\" href=\"#skewed-experience\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Whoa, this other project has a lot of configuration parameters!  Let's just use\nthe defaults.</em></p>\n<p>Software is often easy to set up, but often requires experience to set up\noptimally.  Authors are naturally more adept at setting up their own software\nthan the software of their competition.</p>\n<p>My original (and flawed) solution to this was to \"just use the defaults\" on\nboth projects.  Given my inability to tune Spark (there are several dozen\nparameters) I decided to also not tune Dask and run under default settings.  I\nfigured that this would be a good benchmark not only of the software, but also\non choices for sane defaults, which is a good design principle in itself.</p>\n<p>This failed spectacularly because I was making unconscious decisions like the\nsize of machines that I was using for the experiment, CPU/memory ratios, and so on.\nIt turns out that Spark's defaults are optimized for <em>very small machines</em> (or\nmore likely, small YARN containers) and use only 1GB of memory per executor by\ndefault while Dask is typically run on larger boxes or has the full use of a\nsingle machine in a single shared-memory process.  My standard cluster\nconfigurations were biased towards Dask before I even considered running a\nbenchmark.</p>\n<p>Similarly the APIs of software projects are complex and for any given problem\nthere is often both a fast way and a general-but-slow way.  Authors naturally\nchoose the fast way on their own system but inadvertently choose the general\nway that comes up first when reading documentation for the other project.  It\noften takes months of hands-on experience to understand a project well enough\nto definitely say that you're not doing things in a dumb way.</p>\n<p>In both cases I think the only solution is to collaborate with someone that\nprimarily uses the other system.</p>\n<h2 id=\"preference-towards-strengths\">Preference towards strengths<a class=\"headerlink\" href=\"#preference-towards-strengths\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Oh hey, we're doing </em><em>really</em><em> well here.  This is great!  Let's dive into this a\nbit more.</em></p>\n<p>It feels great to see your project doing well.  This emotional pleasure\nresponse is powerful.  It's only natural that we pursue that feeling more,\nexploring different aspects of it.  This can skew our writing as well.  We'll\nfind that we've decided to devote 80% of the text to what originally seemed\nlike a small set of features, but which now seems like <em>the main point</em>.</p>\n<p>It's important that we define a set of things we're going to study ahead of\ntime and then stick to those things.  When we run into cases where our project\nfails we should take that as an opportunity to raise an issue for future\n(though not current) development.</p>\n<h2 id=\"tuning-during-experimentation\">Tuning during experimentation<a class=\"headerlink\" href=\"#tuning-during-experimentation\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Oh, I know why this is slow.  One sec, let me change something in the code.</em></p>\n<p>I'm doing this right now.  Dask dataframe shuffles are generally slower than\nSpark dataframe shuffles.  On numeric data this used to be around a 2x\ndifference, now it's more like a 1.2x difference (at least on my current\nproblem and machine).  Overall this is great, seeing that another project was\nbeating Dask motivated me to dive in [(see dask/distributed</p>\n<h1 id=\"932httpsgithubcomdaskdistributedissues932-and-this-will-result-in\">932)](https://github.com/dask/distributed/issues/932) and this will result in<a class=\"headerlink\" href=\"#932httpsgithubcomdaskdistributedissues932-and-this-will-result-in\" title=\"Permanent link\">&para;</a></h1>\n<p>a better experience for users in the future.  As a developer this is also how I\noperate.  I define a benchmark, profile my code, identify bottlenecks, and\noptimize.  Business as usual.</p>\n<p>However as an author of a comparative benchmark this is also somewhat dishonest;\nI'm not giving the Spark developers the same opportunity to find and fix\nsimilar performance issues in their software before I publish my results.  I'm\nalso giving a biased picture to my readers.  I've made all of the pieces that\nI'm going to show off fast while neglecting the others.  Picking benchmarks,\noptimizing the project to make them fast, and then publishing those results\ngives the incorrect impression that the entire project has been optimized to\nthat level.</p>\n<h2 id=\"omission\">Omission<a class=\"headerlink\" href=\"#omission\" title=\"Permanent link\">&para;</a></h2>\n<p><em>So, this didn't go as planned.  Let's wait a few months until the next release.</em></p>\n<p>There is no motivation to publish negative results.  Unless of course you've\njust written a blogpost announcing that you plan to release benchmarks in the\nnear future.  Then you're really forced to release numbers, even if they're\nmixed.</p>\n<p>That's ok. Mixed numbers can be informative.  They build trust and\ncommunity.  And we all talk about open source community driven software, so\nthese should be welcome.</p>\n<h2 id=\"straight-up-bias\">Straight up bias<a class=\"headerlink\" href=\"#straight-up-bias\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Look, we're not in grad-school any more.  We've got to convince companies to\nactually use this stuff.</em></p>\n<p>Everything we've discussed so far assumes best intentions, and that the author is\nacting in good faith, but falling victim to basic human failings.</p>\n<p>However many developers today (including myself) are paid and work for\nfor-profit companies that need to make money.  To an increasing extent making\nthis money depends on community mindshare, which means publishing\nbenchmarks that sway users to our software.  Authors have bosses that\nthey're trying to impress or the content and tone of an article may be\ninfluenced by people within the company other than the stated author.</p>\n<p>I've been pretty lucky working with Continuum Analytics (my employer) in that\nthey've been pretty hands-off with technical writing.  For other\nemployers that may be reading, we've actually had an easier time getting\nbusiness because of the honest tone in these blogposts in some cases.\nPotential clients generally have the sense that we're trustworthy.</p>\n<p>Technical honesty goes a surprisingly long way towards implying technical\nproficiency.</p>", "image": "https://matthewrocklin.com/assets/images/social/biased-benchmarks.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2017-03-09T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/brevity/", "url": "https://matthewrocklin.com/brevity/", "title": "Short attention span", "content_html": "<h1 id=\"short-attention-span\">Short Attention Span<a class=\"headerlink\" href=\"#short-attention-span\" title=\"Permanent link\">&para;</a></h1>\n<p>Speaking truth is easy.  Getting people to listen is hard.</p>\n<h2 id=\"summary\">Summary<a class=\"headerlink\" href=\"#summary\" title=\"Permanent link\">&para;</a></h2>\n<p>This post talks about communicating effectively to a short attention span.\nIt lays out practical writing style advice to respect the reader through brevity.</p>\n<p>In particular, we discuss the construction and use of an <em>attention span budget</em>.</p>\n<h2 id=\"ten-tips-for-keeping-attention\">Ten Tips for Keeping Attention<a class=\"headerlink\" href=\"#ten-tips-for-keeping-attention\" title=\"Permanent link\">&para;</a></h2>\n<p>Let's go through the following ten tips to establish reader trust and build attention span:</p>\n<h3 id=\"1-tell-them-where-theyre-going\">1.  Tell them where they're going<a class=\"headerlink\" href=\"#1-tell-them-where-theyre-going\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Uncertainty causes stress.  Reduce reader stress.</em></p>\n<p>Also, give them a roadmap in case they want to skip around.</p>\n<p>In this post we're going to cover the following tips:</p>\n<ol>\n<li>Tell them where they're going</li>\n<li>Front-load content and results</li>\n<li>Break up long blocks of prose</li>\n<li>Earn and then burn attention span</li>\n<li>Say important things</li>\n<li>Avoid boilerplate</li>\n<li>Acknowledge bias to build trust</li>\n<li>Be brutally concise</li>\n<li>Don't fill time</li>\n<li>A worked example</li>\n</ol>\n<h3 id=\"2-front-load-content\">2. Front-load content<a class=\"headerlink\" href=\"#2-front-load-content\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Put the important bits first.</em></p>\n<p>More readers will start your post than will finish it, and those that finish it\nwill skim.</p>\n<p>You'll notice that every section of this document includes a single line of\ntext at the top of the section.  This is because I know that you will skim,\nand I want to make sure that you get the gist of my message, even if you don't\nstay around for the whole thing.</p>\n<p>Front-loading content helps us to earn the readers' attention,\nand helps make sure the reader gets our message,\neven if we don't achieve their attention for long.</p>\n<h3 id=\"3-break-up-long-blocks-of-prose\">3. Break up long blocks of prose<a class=\"headerlink\" href=\"#3-break-up-long-blocks-of-prose\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Humans like variety.  Switch between different visual elements every few lines.</em></p>\n<p>By \"visual elements\" I mean things like the following:</p>\n<ol>\n<li>Paragraphs of normal prose</li>\n<li>Bulleted lists, like this one</li>\n<li><strong>Bold text</strong> on a single line, or an indented quote</li>\n<li>Code blocks (especially if you have colorful syntax highlighting)</li>\n</ol>\n<p>Paragraphs or lists longer than four lines are often skipped.\nHowever if you interleave paragraphs and bulleted sections,\nor include some bold text lines and code blocks in there then people\nfind it more reasonable to go through, even if it's the exact same content.</p>\n<p><strong>Interleaving style is an easy way to break things up.</strong></p>\n<h3 id=\"4-deliver-lessons-after-earning-the-readers-attention\">4. Deliver lessons after earning the reader's attention<a class=\"headerlink\" href=\"#4-deliver-lessons-after-earning-the-readers-attention\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Win the listener's respect before you ask for their time.</em></p>\n<p>I arrive at content excited.  I've already clicked on a post or entered a\nconference talk.  I've bought in.</p>\n<p>However, that excitement lasts about 20 seconds for a blog post or three\nminutes for a conference talk.  It is within that time that we need to hook the\nlistener/reader and make them want to stay for longer.</p>\n<p>This looks different in different contexts:</p>\n<ol>\n<li>\n<p>In a conference talk I often start out with a live demo.\n    Most people save this for the end of the talk,\n    but to me that seems like a missed opportunity to earn attention quickly.</p>\n<p>By seeing a flashy demo the audience is riveted and super-curious about how you achieved it.\nThey'll hang on every word to figure out your magic.</p>\n</li>\n<li>\n<p>In a blog post you might put important results up front in the summary,\n    or start with your primary image.\n    You can include these results or images later in the post as well after you've built context,\n    but giving them dessert before the meal can help get them excited.</p>\n</li>\n</ol>\n<p>As an analogy think about a child sitting down to play a game.  They'll listen\nfor a little while to learn about the instructions, but you have to get playing\nwithin a few minutes, or else they get agitated and leave.  If you can\nmanage it, design your game so that you can start playing right away.\nThen, once they're invested in the game and see that it's fun you can get\npretty deep into the rules and they'll be excited to learn more.</p>\n<p>We have to earn the listener's attention before we can use it to teach them\nthings.</p>\n<p>(<em>small pet peeve, when writing talk slides try to avoid placing an \"About me\"\nsection at the front.  This burns one of your three minutes of starter\nattention span.  The audience probably didn't come to learn about you.</em>)</p>\n<h3 id=\"5-teach-something\">5. Teach something.<a class=\"headerlink\" href=\"#5-teach-something\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Write for a reason.</em></p>\n<p>My most popular blog posts were written in a state of controlled rage.</p>\n<ol>\n<li><a href=\"https://matthewrocklin.com/blog/2019/02/28/slack-github\">Why I Avoid Slack?</a></li>\n<li><a href=\"https://matthewrocklin.com/blog/2019/05/18/maintainer\">The Role of a Maintainer</a></li>\n<li><a href=\"https://matthewrocklin.com/blog/work/2016/02/08/tests\">Write tests.</a></li>\n</ol>\n<p>These were conversations that I had had hundreds of times and wanted to have no longer.\nI wanted to change the behaviors of people immediately around me.\nThey weren't solving abstract problems or thinking broadly about what the world\nmight be.  No.  They were tightly scoped and specific and borne of great\ninternal turmoil.</p>\n<p>The key to a great blog post is to channel internal turmoil into a fair, balanced, and concise document.</p>\n<h3 id=\"6-be-novel-avoid-boilerplate\">6.  Be Novel. Avoid Boilerplate.<a class=\"headerlink\" href=\"#6-be-novel-avoid-boilerplate\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Most content generated by companies today is low-information.  Don't copy their bad style.</em></p>\n<p>Marketing professionals today employ ghost writers who translate a relevant\nmessage into 1000 words.\nHere is an example:</p>\n<ul>\n<li><strong>Product Marketing team</strong>: <em>We just released our new machine learning product that helps companies meet their cyber security needs.  We would like to raise awareness.</em></li>\n<li><strong>Ghost writer</strong>: <em>Sure. 1000 word blog post coming right up</em></li>\n</ul>\n<p>This becomes a long post about the company's\nhistory, the history of cyber-security, how machine learning has been used to\nrevolutionize other fields, and other things that readers have already read.\nMore often than not it's a waste of time.</p>\n<p>If you're new to writing, then you might be tempted to copy what you see.\nThis is safe, but I encourage you to develop your own style quickly.\nBe brief, be genuine, and rework the same content a few times and you'll\nkick the crap out of ghost content within a few tries.\nYou don't need to \"try to look like a blog post\".</p>\n<p><em>This applies to slide presentations, talks, and everything else too</em></p>\n<h3 id=\"7-stay-balanced-acknowledge-your-bias\">7.  Stay Balanced. Acknowledge Your Bias<a class=\"headerlink\" href=\"#7-stay-balanced-acknowledge-your-bias\" title=\"Permanent link\">&para;</a></h3>\n<p><em>The best way to establish trust is to acknowledge your bias</em></p>\n<p><em>Well, hey, I get paid if you buy this thing, so you probably shouldn't trust me, but let's dive into it and you can come to your own conclusions.</em></p>\n<p>Honesty is disarming and a wonderful way to establish connection.\nIt has the side benefit of being the right thing to do.</p>\n<p>My favorite example of this is our <a href=\"https://docs.dask.org/en/latest/spark.html\">Dask vs Spark</a> documentation.\nIt's informative and tries hard to be unbiased.\nIt also ends with this line, which we've gotten repeated praise for:</p>\n<blockquote>\n<p>If you are looking to manage a terabyte or less of tabular CSV or JSON data, then you should forget both Spark and Dask and use Postgres or MongoDB.</p>\n</blockquote>\n<p>:)</p>\n<p>Also, staying balanced and honest will build self-respect.\nWe're social animals, and being honest to our neighbors makes us feel fulfilled.</p>\n<h3 id=\"8-be-brutally-concise\">8.  Be Brutally Concise<a class=\"headerlink\" href=\"#8-be-brutally-concise\" title=\"Permanent link\">&para;</a></h3>\n<p><em>Every word costs attention.  Remove unnecessary words.</em></p>\n<h3 id=\"9-dont-fill-time\">9.  Don't fill time<a class=\"headerlink\" href=\"#9-dont-fill-time\" title=\"Permanent link\">&para;</a></h3>\n<p><em>When you're done, be done.  Everyone appreciates getting time back.</em></p>\n<h3 id=\"10-example\">10. Example<a class=\"headerlink\" href=\"#10-example\" title=\"Permanent link\">&para;</a></h3>\n<p>This is the last piece of material I was working on with a colleague about an upcoming webinar.\nWe're going to show before and after:</p>\n<h4 id=\"before\">Before<a class=\"headerlink\" href=\"#before\" title=\"Permanent link\">&para;</a></h4>\n<p>This Thursday at 5pm ET, we’ll be piloting our very first YouTube Live stream here at Coiled!</p>\n<p>We’ll be talking about scalable computing, when you want to do it and when you don’t, and doing some live Python coding to show you how to</p>\n<ul>\n<li>Use Dask to scale up your pandas code to larger datasets locally, in order to utilize all your cores on your laptop or local workstation and</li>\n<li>Use Dask and Coiled to scale out your computation to a cluster on the cloud, when you need more cores than your laptop can provide.</li>\n</ul>\n<p>We’ll first chat about the general uses of distributed computing and how to figure out when you really need to use it (generally when you’re either RAM-bound or CPU-bound). We’ll then dive into using the now famous NYC taxi dataset and we’ll see how you can seamlessly move from pandas to dask to scale up computation, all within the comfortable environment of JupyterLab. The scalable dask code you write mimics the pandas API because, as we’ve written before, the social goal of dask was to “invent nothing” (we wanted to be as familiar as possible to what users already knew in the PyData stack).</p>\n<h4 id=\"after\">After<a class=\"headerlink\" href=\"#after\" title=\"Permanent link\">&para;</a></h4>\n<p>Join us for Coiled's first live stream!</p>\n<p>We'll cover both the opportunities and the challenges of scaling data science workloads with Pandas using a real-world example:</p>\n<ol>\n<li>Explore and clean a raw dataset with Pandas</li>\n<li>Scale this workload locally with Dask</li>\n<li>Scale this workload onto the cloud with Dask and Coiled</li>\n</ol>\n<p>Join us this Thursday 5pm US Eastern time as we encounter, triage,\nand resolve common challenges that come with scaling data science in the real world.</p>\n<h4 id=\"analysis\">Analysis<a class=\"headerlink\" href=\"#analysis\" title=\"Permanent link\">&para;</a></h4>\n<p>We've lost some content, but everything is a lot tighter.\nThe content that we lost wasn't critical to our objective of informing the\nreader that they should attend the webinar, or what the webinar would be about.</p>\n<h2 id=\"extra-personal-anecdote\">Extra: Personal Anecdote<a class=\"headerlink\" href=\"#extra-personal-anecdote\" title=\"Permanent link\">&para;</a></h2>\n<p><em>My first draft of this post had this section first, but I figured it wasn't\nthat important, so I put it down here instead.  You can safely skip it.</em></p>\n<p>Teaching students taught me the value of writing to an attention budget.</p>\n<p>As a graduate student I taught computer science to technical non-majors\n(physics/math/econ students mostly).  Students participated in practical\nsessions in the computer lab where they would read a set of instructions and\nthen proceed to work through projects with us behind them.</p>\n<p>The instructions looked like this:</p>\n<blockquote>\n<p>Today we're covering object oriented programming and classes.  A class looks\nlike this:</p>\n</blockquote>\n<div class=\"highlight\"><pre><span></span><code><span class=\"k\">class</span><span class=\"w\"> </span><span class=\"nc\">Human</span><span class=\"p\">:</span>\n    <span class=\"k\">def</span><span class=\"w\"> </span><span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"n\">name</span><span class=\"p\">:</span> <span class=\"nb\">str</span><span class=\"p\">):</span>\n        <span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">name</span> <span class=\"o\">=</span> <span class=\"n\">name</span>\n\n    <span class=\"k\">def</span><span class=\"w\"> </span><span class=\"nf\">mate</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"n\">partner</span><span class=\"p\">:</span> <span class=\"n\">Human</span><span class=\"p\">)</span> <span class=\"o\">-&gt;</span> <span class=\"n\">Child</span><span class=\"p\">:</span>\n        <span class=\"o\">...</span>\n</code></pre></div>\n<blockquote>\n<p>In our next exercise you will extend this class to ...</p>\n</blockquote>\n<p>And so on.  When I wrote bad instructions, all of the students would have lots\nof problems, and the lab was stressful for me.  When I wrote good instructions the\nstudents would be fine and I could relax and joke around with them (scientists\nwho choose to learn programming are invariably great to be around).</p>\n<p>To be clear the difference between \"good\" and \"bad\" instructions wasn't in the\ncontent, it was whether or not the student actually read through all of the instructions.</p>\n<p><strong>Teaching is a game where you have to capture someone's attention while\nsimultaneously shoving knowledge into their brain.</strong></p>\n<p><em>Thank you to <a href=\"https://hugobowne.github.io/\">Hugo Bowne-Anderson</a> for his thoughtful remarks on this post</em></p>", "image": "https://matthewrocklin.com/assets/images/social/brevity.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2020-07-13T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/camino/", "url": "https://matthewrocklin.com/camino/", "title": "I Walked across Spain", "content_html": "<h1 id=\"i-walked-across-spain\">I Walked Across Spain<a class=\"headerlink\" href=\"#i-walked-across-spain\" title=\"Permanent link\">&para;</a></h1>\n<p>Last month I walked across Spain, east to west, following the historic <a href=\"https://en.wikipedia.org/wiki/Camino_de_Santiago\">Camino de Santiago</a>,\na historic pilgrimage route travelled by thousands of people a year.  It was an experience.</p>\n<p>Since returning lots of people have been asking me a seemingly simple question:</p>\n<blockquote>\n<p>So how was the Camino?</p>\n</blockquote>\n<p>And it's been difficult for me to give a pithy answer that fits neatly into a conversation.\nThis post is my attempt to solve that problem.  Here's a written version of some reflections from my walk.</p>\n<h2 id=\"overlapping-experiences\">Overlapping Experiences<a class=\"headerlink\" href=\"#overlapping-experiences\" title=\"Permanent link\">&para;</a></h2>\n<p>I think that the Camino is best understood as several overlapping experiences.  It is a ...</p>\n<ul>\n<li>Physical experience</li>\n<li>Social experience</li>\n<li>Cultural experience</li>\n<li>Religious experience</li>\n<li>Cloistered experience</li>\n<li>Humanist experience</li>\n</ul>\n<p>Overlapping these experiences at the same time weaves a meaningfully different way of life than I've found elsewhere,\nneither in normal quotidian life, nor in vacations or other physical adventures.</p>\n<p>I'll briefly share my thoughts and personal experiences on each layer:</p>\n<h2 id=\"physical\">Physical<a class=\"headerlink\" href=\"#physical\" title=\"Permanent link\">&para;</a></h2>\n<p>I walked the typical route of the Camino Frances, starting from the French border in Saint Jean Pied de Port.\nThis crosses the Pyrenees on the first day\n(imagine being a downed WWII RAF pilot escaping occupied France into neutral Spain in some Hemmingway-era novel)\nand then continues 500 miles / 800 kilometers to Northwestern Spain, and the town of Santiago de Compostella.\nThat's roughly 20 marathons, back to back.</p>\n<p><img alt=\"\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/The_French_Way.svg/1920px-The_French_Way.svg.png\" /></p>\n<p>This is both easier than it sounds, and harder than it sounds.</p>\n<p>Walking a long distance is actually pretty easy when it's all you have to do for the day.\nYou pick up a slow and natural pace and just keep at it.\nYou're carrying gear, but not much (the walk is supported with hostels and cafes along the way).\nThe median walker is probably a retiree in their sixties who does about 20km a day.\nI'm a pretty fit 40-year-old and did anywhere from 20km-50km a day.  I finished in 27 days.</p>\n<p>However, walking this distance is also a harder than it sounds because of accumulated stress.\nIn normal life you're active one day and play hard, and then the next you rest and recuperate.\nOn the Camino you just keep going day after day.\nYour body accumulates stress and injuries but you adapt and walk through that stress, eventually reaching an equilibrium where you heal about as quickly as you injure yourself.\nPeople manage blisters, joint pain, swelling, plantar fascitis, diabetes, and more.</p>\n<p>Personally, I fell and bruised my knee pretty badly the second day and then promptly did a lot of descent,\nwhich caused a highly inflamed knee that I walked on for about a week before it healed.\nThen after a couple weeks, my metatarsals / forefeet became inflamed which took some getting used to and slowed me down.\nI walked in minimalist footwear (Vibram-five-fingers) which is totally normal for me at home (I've worn them for close to 20 years and run barefoot regularly) but I had never experienced this much repetitive stress for this long, which made it all the more interesting to accomplish.</p>\n<p>This level of endurance was a new kind of challenge for me, and discovering this level of resilience was a new kind of satisfaction.</p>\n<h2 id=\"social\">Social<a class=\"headerlink\" href=\"#social\" title=\"Permanent link\">&para;</a></h2>\n<p>Physicality aside, socially the Camino is simultaneously a solitary and communal experience.</p>\n<h3 id=\"first-day\">First day<a class=\"headerlink\" href=\"#first-day\" title=\"Permanent link\">&para;</a></h3>\n<p>I arrived in France alone, and travelled to St Jean alone, and set off from my hotel in the pre-dawn morning alone\n(thanks for the early start Jetlag!).  But you cross paths with other walkers pretty quickly and stop and chat for a while.\nThat first day included people like ...</p>\n<ul>\n<li>An American teacher just starting her Summer break</li>\n<li>A Brazilian guy my age who spoke no English and about as bad of Spanish as mine, which made for jovial if halting conversation</li>\n<li>A Swiss gentleman who had walked from Switzerland</li>\n<li>A Dutch woman taking a break from her cyber-security consultancy</li>\n<li>An American couple, one of whom was deeply struggling with diabetes and blood sugar regulation</li>\n<li>An American family from Texas (parents, three daughters aged 16-19) that I met throughout the day (the daughters were faster than the parents)</li>\n<li>An Australian priest who had just finished graduate school</li>\n<li>An American religious studies professor, recently retired</li>\n<li>A French retiree who had walked from a town much more deeply in France, and was finishing at the Spanish border (my first day on the Camino was his last)</li>\n</ul>\n<p>You have easy chats and then walk on.  At the end of the day you all arrive at a big hostel where there are shared meals.  You eat together, drink together, and chat about the walk.  It was lovely.</p>\n<p>Then you sleep (poorly), wake up, and do it all again.</p>\n<h3 id=\"all-the-other-days\">All the other days<a class=\"headerlink\" href=\"#all-the-other-days\" title=\"Permanent link\">&para;</a></h3>\n<p>The Camino is a river of people.  Some people are fast, some are slow.  Some start early, some late.  Some are chatty, some mostly silent.  Everyone walks a little differently.</p>\n<p>Emotionally you bond quickly with people (easy when you all struggle towards the same goal, suffering the same hardships) and you form groups.\nOver time, for various reasons those groups grow and shift and break.  People get injured and take rest days; people feel energy and burst forward; people start or stop their journey at different cities to get back to normal life.</p>\n<p>There's a tension between staying with people you've bonded with and walking in a way that suits you.\nIt's like life generally, just compressed.\nThere's a strong pull to stay with a familiar group, but ultimately everyone walks their own Camino.</p>\n<h2 id=\"cultural\">Cultural<a class=\"headerlink\" href=\"#cultural\" title=\"Permanent link\">&para;</a></h2>\n<p>Spain is a wonderful host country for this kind of activity.\nThe vibe is chill; the people are warm; the food is cheap.  It's super accessible.\nThat being said, the Camino is not an especially Spanish experience.</p>\n<p>There are a few Spaniards walking the Camino, but not many,\nand most interactions with townspeople are practical in nature.\nAnd while the Camino stops is a few delightful cities (Burgos, Leon, Santiago, ...)\nthe majority of the time you're out in countryside or in very small villages of 100 people or less.</p>\n<p>To make this concrete, people often ask me \"how was the food!?\"\nto which my answer is \"pretty terrible actually\".\nThis isn't a reflection on Spanish cuisine,\nbut rather on the fact that we're walking through tiny towns,\nand that Spanish restaurants open at 8pm and pilgrims are usually bedded down by 9pm.\nAs a result most of my calories came in the form of bananas/nuts/sausages picked up at small grocery stores,\nSpanish tortilla (a potato based quiche dish) and non-alcoholic beer found in roadside bar/cafes\n(NA beer is delightfully ubiquitous in Spain, and the perfect mid-walk beverage).\nDinner was typically prepared in a hostel by hostel staff who, while delightful, were not especially accomplished chefs.</p>\n<p>Culturally the Camino is more of a globalist/international experience than a Spanish one.\nLinguistically there were a few groupings:</p>\n<ul>\n<li><strong>English:</strong> typically North American, Australian, and New Zealanders, as well as Germans and Dutch.  Maybe 40%?</li>\n<li><strong>French:</strong> on the Camino Frances there are a number of French speakers, maybe 20% at the beginning dropping to 10% by the end?</li>\n<li><strong>Spanish:</strong> consisting of some Spaniards, but more Latin Americans, as well as Portuguese and Italian speakers, all of whom get by in an interesting (and incredibly easy to understand) Spanish patois</li>\n<li><strong>Korean:</strong> a surprising though delightful group, South Koreans made up maybe 5-10% of the pilgrims, and are by far the most represented East Asian country due to their stronger Christian heritage there.</li>\n<li><strong>Other:</strong> some Japanese and Chinese (more-often Taiwanese).</li>\n</ul>\n<p>While quite different and sometimes unable to communicate, these groups got along amazingly well.\nThere's a culture of understanding and charity on the Camino that's universal.\nI received help and support (like blister care) from people I had just met and couldn't speak to,\nand happily gave what I had to others.\nMy claim to fame in terms of generosity was organizing an Amazon shipment of Lacrosse balls to give out along the trail (the one I brought from home was in incredibly high demand in hostels for foot massage).</p>\n<p>Despite most pilgrims not being religious,\nthe Camino's culture was one of the better expressions of some Christian values I've experienced.</p>\n<h2 id=\"religious\">Religious<a class=\"headerlink\" href=\"#religious\" title=\"Permanent link\">&para;</a></h2>\n<p>The Camino de Santiago was and is an important religious pilgrimage.\nWe're walking to the site of the remains of Saint-James (or in Latin Sant-Iago), one of the twelve apostles.\nChristians have walked from their homes to the site of his remains for a thousand years (and then amazingly, also walked back).</p>\n<p>I am not religious, and I'd say that the minority of pilgrims are today.\nBut walking with the more devout pilgrims was a treat.\nEmpathy is so natural on the Camino that you get to feel a little bit of their experience second-hand.</p>\n<p>For those who were interested there was nightly mass to attend, historically relevant\nchurches/cathedrals/hermitages/etc. to visit, monasteries to stay in, and so on.</p>\n<p>I didn't engage this layer much, but I appreciated its presence.\nBeing among the religious pilgrims helped to make the walk more than just a big hike.</p>\n<h2 id=\"humanist\">Humanist<a class=\"headerlink\" href=\"#humanist\" title=\"Permanent link\">&para;</a></h2>\n<p>The people walking the Camino come at interesting times of their lives.\nI met people who ...</p>\n<ul>\n<li>just retired</li>\n<li>just quit their job</li>\n<li>recently separated from a partner</li>\n<li>lost a loved one</li>\n<li>were trying to lose weight</li>\n<li>just given up a drug habit</li>\n<li>just sent a loved one to rehab, and for the first time had time to themselves</li>\n</ul>\n<p>Generally the pilgrims are at interesting and reflective phases of life,\nand that brings some interesting energy to the crowd.\nEveryone is thoughtful and generally open to change in life.\nThis cultivates both a level of empathy and emotional honesty that I found pervaded the experience.</p>\n<h2 id=\"cloistered\">Cloistered<a class=\"headerlink\" href=\"#cloistered\" title=\"Permanent link\">&para;</a></h2>\n<p>You're so focused as a group on walking that you naturally detach from the broader world outside the Camino.\nThis was surprisingly meaningful.</p>\n<p>Like most people, I check my e-mail / the news / my phone actively throughout the day.\nThis behavior goes well beyond \"staying on top of work\";\nit has become a pretty strong compulsion for me (and for many of us I think).\nI don't think it serves me well, but I've historically struggled to change the behavior in a lasting way.</p>\n<p>Fortunately, on the Camino that desire to check in with the world disappeared entirely.\nThe novelty and buzz of the world felt boring and unwelcome.\nI didn't check my e-mail or the news for days at a time, not through intention and discipline, but through lack of interest.</p>\n<p>Although when I finally did check the news I found that it had been a pretty intense few weeks for others.\nThis period included both the LA immigration riots and the attacks on Iran.</p>\n<p>This made me think more about the right level of active engagement one should do.\nI think that one should care about the world, but perhaps not at the cadence that is typical today.\nThere's a frequency and mania of staying on top of things that I don't think meaningfully helps; and does considerable harm.</p>\n<h2 id=\"lessons\">Lessons<a class=\"headerlink\" href=\"#lessons\" title=\"Permanent link\">&para;</a></h2>\n<p>The Camino was hard and like many hard things, it changes one's perspective.</p>\n<p>Upon returning people ask me:</p>\n<blockquote>\n<p>\"What did you learn?\"</p>\n<p>\"What did you take away?\"</p>\n</blockquote>\n<p>I'm not sure I learned a specific lesson,\nbut I do think that stepping outside of my life and walking the Camino instilled a few behaviors or qualities that I appreciate:</p>\n<ul>\n<li>\n<p><strong>Introspective:</strong> I'm more open to questioning larger parts of my life</p>\n<ul>\n<li>\"do I like living in my city?\"</li>\n<li>\"is this particular relationship serving me?\"</li>\n<li>\"would I prefer to stop attending this regular event?\"</li>\n</ul>\n<p>rather than going with the flow that past-me set up.  I'm more active in assessing what I do and do not appreciate, and more open to making more decisive changes.</p>\n</li>\n<li>\n<p><strong>Calm:</strong> I think I'm more thoughtful and less frantic with how I engage with the wider world. Not meaningfully less engaged I don't think; just a bit less manic about it.</p>\n</li>\n<li>\n<p><strong>Satisfaction:</strong> I seem a little more satisfied with life moment-by-moment.  The persistent nagging voice in my head saying things aren't good enough seems a lot quieter today.  I take more naps and sit outside watching people more often.</p>\n</li>\n</ul>\n<p>It's been a few weeks since I stopped walking and these traits so far have stuck around; which I find encouraging.</p>\n<h2 id=\"call-to-action\">Call to Action<a class=\"headerlink\" href=\"#call-to-action\" title=\"Permanent link\">&para;</a></h2>\n<p>My age group (30s-50s) was generally absent on the Camino.</p>\n<p>That makes sense; we're in our most productive years.\nWe're raising kids and at the peak of our career\nand so reasonably find it difficult to take a month away.</p>\n<p>However I encourage people to try.\nThis might be an especially important time to step outside our lives and reflect on what we want from it.</p>", "image": "https://matthewrocklin.com/assets/images/social/camino.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2025-07-14T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/claude-chic-week-2/", "url": "https://matthewrocklin.com/claude-chic-week-2/", "title": "Claude Chic: Week 2", "content_html": "<h1 id=\"claude-chic-week-2\">Claude Chic: Week 2<a class=\"headerlink\" href=\"#claude-chic-week-2\" title=\"Permanent link\">&para;</a></h1>\n<p><em>Unlike most of my writing, this post was largely written by Claude</em>:</p>\n<p>It's been one week since we <a href=\"/introducing-claude-chic\">introduced Claude Chic</a>, and adoption and development since then have been fun.</p>\n<p>This week saw 75 commits from 7 contributors.  Broadly we saw the following themes:</p>\n<ul>\n<li>\n<p>Smoothing out UX rough edges</p>\n<p>When a project goes from single-user to many users there are always various rough edges to smooth out.  These included Linux and Windows keybindings, Native Windows support (not just WSL), bugs in <code>/resume</code> and <code>/plan</code>, and much more.</p>\n</li>\n<li>\n<p>Multi-agent workflows</p>\n<p>I've been exploring this space recently and seeing what I like and don't like.  I'll describe some things that I like and built into Claude Chic just below.</p>\n</li>\n<li>\n<p>Performance</p>\n<p>Running several long sessions concurrently stressed our use of Textual.  Various enhancments were made to smooth things out.</p>\n</li>\n<li>\n<p>Quality of Life</p>\n<p>There are many small things that we added like support for custom themes, small screen / mobile support, and more.</p>\n</li>\n</ul>\n<p>Now, let's dig into some highlights:</p>\n<h2 id=\"multi-agent-workflows\">Multi-Agent Workflows<a class=\"headerlink\" href=\"#multi-agent-workflows\" title=\"Permanent link\">&para;</a></h2>\n<p>The headline this week is new ways to use multiple agents together.  The idea: having Claude debate itself produces more thorough analysis.</p>\n<h3 id=\"plan-swarms\">Plan Swarms<a class=\"headerlink\" href=\"#plan-swarms\" title=\"Permanent link\">&para;</a></h3>\n<p><code>/plan-swarm</code> spawns multiple agents to debate implementation approaches before you commit to one:</p>\n<div class=\"highlight\"><pre><span></span><code>/plan-swarm Add caching to the API layer\n</code></pre></div>\n<p>This spawns several agents, each exploring the problem from a different angle—one might advocate for Redis, another for in-memory caching, a third for a hybrid approach.  They present their cases to each other, debate, and often (but not always) come to consensus. You then pick the direction that resonates.</p>\n<h3 id=\"review-agents\">Review Agents<a class=\"headerlink\" href=\"#review-agents\" title=\"Permanent link\">&para;</a></h3>\n<div class=\"highlight\"><pre><span></span><code>/reviewer\n</code></pre></div>\n<p>This spawns an agent whose job is to critically examine your recent changes.  You mediate as they iterate toward agreement.</p>\n<h3 id=\"infrastructure\">Infrastructure<a class=\"headerlink\" href=\"#infrastructure\" title=\"Permanent link\">&para;</a></h3>\n<p>Full plan mode support landed via the SDK's <code>set_permission_mode</code>, with proper tool restrictions during planning and feedback when you reject a plan.</p>\n<h2 id=\"custom-themes\">Custom Themes<a class=\"headerlink\" href=\"#custom-themes\" title=\"Permanent link\">&para;</a></h2>\n<p>Claude Chic now supports user-defined themes.  The default dark theme works well on dark terminals, but many developers prefer light backgrounds.</p>\n<div class=\"highlight\"><pre><span></span><code>/theme chic-light\n</code></pre></div>\n<p>Or define your own in <code>~/.claude/chic-theme.json</code>:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"p\">{</span>\n<span class=\"w\">  </span><span class=\"nt\">&quot;name&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;my-theme&quot;</span><span class=\"p\">,</span>\n<span class=\"w\">  </span><span class=\"nt\">&quot;colors&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"nt\">&quot;user_border&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;#ff6600&quot;</span><span class=\"p\">,</span>\n<span class=\"w\">    </span><span class=\"nt\">&quot;assistant_border&quot;</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"s2\">&quot;#0066ff&quot;</span>\n<span class=\"w\">  </span><span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>\n<h2 id=\"the-yolo-flag\">The <code>--yolo</code> Flag<a class=\"headerlink\" href=\"#the-yolo-flag\" title=\"Permanent link\">&para;</a></h2>\n<p>For sandboxed environments where you trust the agent completely:</p>\n<div class=\"highlight\"><pre><span></span><code>claudechic<span class=\"w\"> </span>--yolo\n</code></pre></div>\n<p>(Or <code>--dangerously-skip-permissions</code> if you prefer verbosity.)</p>\n<p>This skips all permission prompts.  Use it in CI pipelines, Docker containers, or when you're feeling reckless.  The name is intentional—if you're using this flag, you should know what you're doing.</p>\n<h2 id=\"performance\">Performance<a class=\"headerlink\" href=\"#performance\" title=\"Permanent link\">&para;</a></h2>\n<p>Multi-agent swarms exposed performance bottlenecks.  Running 5-10 agents simultaneously revealed that we were doing far too much UI work for agents you weren't looking at.</p>\n<p>Key optimizations this week:</p>\n<ul>\n<li><strong>Deferred updates</strong>: Hidden ChatViews no longer process UI updates until you switch to them</li>\n<li><strong>Collapsed history</strong>: Old conversation turns collapse into lightweight placeholders</li>\n<li><strong>Lazy loading</strong>: Collapsible content only renders when expanded</li>\n<li><strong>CSS optimization</strong>: Reduced recalculation during agent switching</li>\n<li><strong>Spinner fix</strong>: The thinking indicator no longer triggers CSS recalc on every frame</li>\n</ul>\n<p>The result: swarms of agents run smoothly without the UI becoming a bottleneck.</p>\n<h2 id=\"quality-of-life\">Quality of Life<a class=\"headerlink\" href=\"#quality-of-life\" title=\"Permanent link\">&para;</a></h2>\n<p>Smaller improvements that add up:</p>\n<ul>\n<li><strong>Immediate feedback</strong>: Creating agents/worktrees shows instant visual response</li>\n<li><strong>Compact mode</strong>: UI adapts to small terminal heights</li>\n<li><strong>Cross-platform shortcuts</strong>: Keyboard bindings work consistently across Mac/Linux/Windows</li>\n<li><strong>Autocomplete</strong>: <code>/worktree</code> and <code>/agent</code> commands now autocomplete existing names</li>\n<li><strong>Horizontal scroll</strong>: Code blocks scroll horizontally instead of wrapping (#28)</li>\n</ul>\n<h2 id=\"bug-fixes\">Bug Fixes<a class=\"headerlink\" href=\"#bug-fixes\" title=\"Permanent link\">&para;</a></h2>\n<p>The usual parade of fixes, including:</p>\n<ul>\n<li>Windows exit warnings (#31)</li>\n<li>Session path encoding to match Claude Code (#20)</li>\n<li>Crash when pasting long text</li>\n<li>Nested tools getting lost after switching agents</li>\n<li>Various multi-agent stability improvements</li>\n</ul>\n<h2 id=\"whats-next\">What's Next<a class=\"headerlink\" href=\"#whats-next\" title=\"Permanent link\">&para;</a></h2>\n<p>This past week was mostly about people other than me trying Claude Chic and reporting issues with their workflow.  I expect more of the same.</p>\n<p>Try it:</p>\n<div class=\"highlight\"><pre><span></span><code>uvx<span class=\"w\"> </span>claudechic<span class=\"w\"> </span>/welcome\n</code></pre></div>\n<p>Or update if you already have it:</p>\n<div class=\"highlight\"><pre><span></span><code>uv<span class=\"w\"> </span>tool<span class=\"w\"> </span>upgrade<span class=\"w\"> </span>claudechic\n</code></pre></div>\n<p><a href=\"https://github.com/mrocklin/claudechic\">GitHub</a> | <a href=\"/claudechic\">Docs</a></p>\n<h2 id=\"contributors\">Contributors<a class=\"headerlink\" href=\"#contributors\" title=\"Permanent link\">&para;</a></h2>\n<p><strong>Code:</strong></p>\n<ul>\n<li><a href=\"https://github.com/avinewman\">Avi Newman</a> - Windows compatibility</li>\n<li><a href=\"https://github.com/chr33z\">Christopher Lamm</a> - plan mode fixes</li>\n<li><a href=\"https://github.com/dotsdl\">David Dotson</a> - vim mode</li>\n<li><a href=\"https://github.com/jumptable\">Laura Martin</a> - exit handling</li>\n<li><a href=\"https://github.com/surminus\">surminus</a> - custom themes</li>\n<li><a href=\"https://github.com/theantichris\">theantichris</a> - session path encoding, model settings</li>\n</ul>\n<p><strong>Issues &amp; Feedback:</strong></p>\n<ul>\n<li><a href=\"https://github.com/andrie\">andrie</a> - WSL timeout</li>\n<li><a href=\"https://github.com/binduwavell\">binduwavell</a> - subagents, small screen support</li>\n<li><a href=\"https://github.com/c0ffee0wl\">c0ffee0wl</a> - auto-approve mode, collapsible tools</li>\n<li><a href=\"https://github.com/cderv\">cderv</a> - Windows issues, worktree context, horizontal scroll</li>\n<li><a href=\"https://github.com/chandlervdw\">chandlervdw</a> - MCP management</li>\n<li><a href=\"https://github.com/dcherian\">dcherian</a> - keyboard shortcuts, agent switching, readline</li>\n<li><a href=\"https://github.com/GaborNyul\">GaborNyul</a> - multiline input, SSO proxy</li>\n<li><a href=\"https://github.com/jeduden\">jeduden</a> - paste crash</li>\n<li><a href=\"https://github.com/maartenbreddels\">maartenbreddels</a> - branch name handling</li>\n<li><a href=\"https://github.com/quasiben\">quasiben</a> - token doubling</li>\n<li><a href=\"https://github.com/rdubwiley09\">rdubwiley09</a> - path defaults</li>\n<li><a href=\"https://github.com/sargunv\">sargunv</a> - plan mode</li>\n</ul>", "image": "https://matthewrocklin.com/assets/images/social/claude-chic-week-2.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2026-02-02T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/cloud-is-broken/", "url": "https://matthewrocklin.com/cloud-is-broken/", "title": "Cloud Computing is Broken", "content_html": "<h1 id=\"cloud-computing-is-broken\">Cloud Computing is Broken<a class=\"headerlink\" href=\"#cloud-computing-is-broken\" title=\"Permanent link\">&para;</a></h1>\n<div class=\"admonition quote\">\n<p class=\"admonition-title\">Famous Quote</p>\n<p><em>This AWS API is so intuitive it's awesome.  My whole team uses it.</em></p>\n<p><em>-– no one ever</em></p>\n</div>\n<h2 id=\"introduction\">Introduction<a class=\"headerlink\" href=\"#introduction\" title=\"Permanent link\">&para;</a></h2>\n<p>Recently I was chatting with an investor about the market and they asked:</p>\n<blockquote>\n<p><em><strong>What do you see coming</strong> for the world of Data/Cloud/Compute Infrastructure?</em><br/>\n<em>Is there some new dataframe library?</em><br/>\n<em>LLM applications?</em><br/>\n<em>What hunger are you seeing on the ground?</em><br/></p>\n</blockquote>\n<p>My answer, after thinking about it for a while, was this:</p>\n<blockquote>\n<p><em>Boring shit.</em><br/>\n<em>The people I talk to struggle most with the </em><em>basics of cloud computing.</em>**</p>\n</blockquote>\n<p>This article explores this answer in more depth, drawing on undelivered promises, and the launch of the iPod.</p>\n<h2 id=\"promise-of-cloud-computing-undelivered\">Promise of Cloud Computing, Undelivered<a class=\"headerlink\" href=\"#promise-of-cloud-computing-undelivered\" title=\"Permanent link\">&para;</a></h2>\n<p>The promise of cloud computing for data developers goes like this:</p>\n<ul>\n<li>Infinite scalability</li>\n<li>Any place any time</li>\n<li>Turned on in about a minute</li>\n<li>Pay for only what you use</li>\n<li>No need to maintain hardware</li>\n</ul>\n<p>This promise is valuable to companies today.  Developers want this.  Companies need this.  Especially those people for whom SQL doesn't suffice and who have to roll their own computations.</p>\n<p>Yet most developers we see either don’t use the cloud, or don’t use it well.\nWe see two common architectures today:</p>\n<p>::::{grid} 1 1 2 2\n:::{grid-item} <strong>Overused Big VM</strong></p>\n<ul>\n<li>They get one Big VM</li>\n<li>They leave it on all the time</li>\n<li>Maintenance needs are surprisingly demanding</li>\n<li>It’s really expensive</li>\n</ul>\n<p>:::\n:::{grid-item} <strong>Underused Kubernetes Cluster</strong></p>\n<ul>\n<li>They deploy Kubernetes</li>\n<li>Experts use it for 1-2 applications</li>\n<li>Normal users never really get on board</li>\n<li>Maintenance costs and non-use eventually kill it</li>\n</ul>\n<p>:::\n::::</p>\n<p>What people want is simple.  They want to turn on a bunch of computers, run arbitrary code on those computers, have those computers turn off reliably, and eventually get logs easily.  They want user and cost management without having to set much up.</p>\n<h2 id=\"dont-awsdatabrickssagemaker-already-provide-these-features\">Don’t AWS/Databricks/Sagemaker already provide these features?<a class=\"headerlink\" href=\"#dont-awsdatabrickssagemaker-already-provide-these-features\" title=\"Permanent link\">&para;</a></h2>\n<p><em>But this stuff already exists, right?</em></p>\n<p>On paper, yes.  AWS Batch/Lambda, Databricks jobs, Snowflake’s Snowpark all provide arbitrary code execution on lots of ephemeral machines with exactly those features.\nIn theory, they deliver on this promise.</p>\n<p>However in practice we don’t see this.  People are still rolling their own with the EC2 and EKS APIs.  I’ll bet that if you surveyed data professionals in organizations with access to modern compute platforms you’d find that the majority who would want to use such a tool don’t use them regularly. I’d guess penetration is in the 10-20% range.</p>\n<p>Providing functionality is easy.  Making functionality useful is hard.</p>\n<p>Cloud computing today is like MP3 players before the iPod.</p>\n<ul>\n<li>Huge potential demand (mp3s were everywhere)</li>\n<li>Theoretical delivery of that product (many products on the market)</li>\n<li>Complete market failure to actually deliver on the promise.</li>\n</ul>\n<h2 id=\"mp3-players-and-the-ipod\">MP3 Players and the iPod<a class=\"headerlink\" href=\"#mp3-players-and-the-ipod\" title=\"Permanent link\">&para;</a></h2>\n<p><em>MP3 players existed, but only kinda.</em></p>\n<p>Imagine you’re Steve Jobs and you want to propose the iPod in year 2000.  Your marketing team tells you that the iPod isn't innovative.  Loads of MP3 players are already on the market and doing poorly.</p>\n<p>Anyone above the age of 35 knows this history.  Recall the RIO 500 and Archos Jukebox.</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align: center;\"><strong>Rio 500</strong></th>\n<th style=\"text-align: center;\"><strong>Archos Jukebox</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align: center;\"><img alt=\"Rio 500\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Rio_500.jpg/1280px-Rio_500.jpg\" /></td>\n<td style=\"text-align: center;\"><img alt=\"Archos Jukebox\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/B%C3%A4rbar_mp3-spelare_Archos_typ_Jukebox_6000.jpg/1280px-B%C3%A4rbar_mp3-spelare_Archos_typ_Jukebox_6000.jpg\" /></td>\n</tr>\n</tbody>\n</table>\n<p>They store songs, let you play them, fast forward, rewind, and show you what’s going on.  On paper they do everything the iPod will do, and yet market penetration was tiny, less than 1% of what it would be.  Looking at the lack of success of these products you’d conclude that humans don’t like listening to music.</p>\n<p><em>The majority of people who would have wanted an MP3 player didn't use any of these products.</em></p>\n<p>Eventually, the iPod was released, and it changed our listening habits forever</p>\n<p><img alt=\"\" src=\"../images/ipod.png\" width=\"60%\" /></p>\n<p><em>iPod Generation One delivered the same functionality, but designed well enough for everyone to want.</em></p>\n<p>Same exact functionality, just better in an indescribable and yet obvious way.  The combination of ease of use, pocketability, storage capacity, iTunes integration, and straight-up style made the iPod a must-have item years after equivalent products launched and failed to create and claim the market.</p>\n<h2 id=\"compute-technology-has-outpaced-ux-and-adoption\">Compute Technology has Outpaced UX and Adoption<a class=\"headerlink\" href=\"#compute-technology-has-outpaced-ux-and-adoption\" title=\"Permanent link\">&para;</a></h2>\n<p><em>We as a technology movement have gotten ahead of ourselves.</em></p>\n<p>I believe in the innovation of the Startup + VC process.  Yet I think that in striving to climb the technology sophistication ladder (cloud computing -&gt; ML -&gt; Model management -&gt; LLMs -&gt; Agentic systems) we’ve outpaced our users and their ability to follow us.</p>\n<p>We’ve chased the few truly sophisticated users out there, the geeky early adopters, rather than the majority of ignorant humans we should be serving.  We’ve been building for Steve Wozniak.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/hFD3tZSB7l4?si=kG3kKKMYgPclekjQ&amp;start=183\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<p>Watch 50s of the video above about Steve's cool watch. <br/>\nThen see ChatGPT explain how to run \"Hello, world\" on AWS Batch below.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Xk_lEt_08Hs?si=7yM7Fi1VIxLvGGcx\" title=\"YouTube video player\" frameborder=\"0\"               allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope;    picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<p>No compassionate human can watch that and think \"Yes, the potential of the cloud has been realized\".<br/>\nWe're not done innovating yet.  There's more to do.</p>\n<h2 id=\"where-does-this-lead-us\">Where does this lead us?<a class=\"headerlink\" href=\"#where-does-this-lead-us\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Let’s strive towards excellence on boring problems</em></p>\n<p>I think that there’s huge untapped potential in solving some of these boring\nproblems well.  This work is hard and finicky, but I think the data\ninfrastructure space has pushed sufficiently far ahead that we've built up\nsubstantial potential behind our frontier.</p>\n<p>I’d love to see UX become as strong a focus as AI for the industry.  I’d encourage technology leaders everywhere to ask the following question:</p>\n<blockquote>\n<p>What important and common problems today lack products that inspire rabid loyalty?</p>\n</blockquote>\n<p>Those problems may be ripe for iPod-style solutions.<br/>\nCloud and compute platforms are certainly among them.</p>", "image": "https://matthewrocklin.com/assets/images/social/cloud-is-broken.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2024-12-03T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/decision-fatigue/", "url": "https://matthewrocklin.com/decision-fatigue/", "title": "Decision Fatigue", "content_html": "<h1 id=\"decision-fatigue\">Decision Fatigue<a class=\"headerlink\" href=\"#decision-fatigue\" title=\"Permanent link\">&para;</a></h1>\n<p>Making decisions is hard work, even if the decisions are low stakes.\nAs proof consider the following questions from your ordinary life:</p>\n<ul>\n<li><em>\"Where do we want to eat tonight?\"</em></li>\n<li><em>\"Which toothpaste brand should I buy?\"</em></li>\n</ul>\n<p>These decisions cause fatigue.\nAt work we help our team by taking on the burden of making good decisions.</p>\n<h2 id=\"when-this-comes-up\">When this comes up<a class=\"headerlink\" href=\"#when-this-comes-up\" title=\"Permanent link\">&para;</a></h2>\n<p>If I've directed you to this article it's because you were in charge of\na thing, ran into a roadblock, and then said one of the following:</p>\n<ul>\n<li><em>\"What do we want to do in this situation?\"</em></li>\n<li><em>\"How do we feel about X?\"</em></li>\n<li><em>\"How do we want to proceed?\"</em></li>\n</ul>\n<p>It's good that when you feel uncertain you ask for input.  Good job 👍.</p>\n<p>However, the phrasing of your question shifts the burden from your shoulders to\nthe group.  This I don't like as much.  Instead, I recommend the following phrasing:</p>\n<ul>\n<li>\n<p><em>\"I'm figuring out X, but I'm running into a problem and I could use some advice.\"</em></p>\n<p><em>\"Here is what I want to achieve ...\"</em></p>\n<p><em>\"This is where I'm getting stuck ...\"</em></p>\n<p><em>\"Without input I would likely do the following ...\"</em></p>\n</li>\n</ul>\n<p>With this phrasing you keep the burden on your shoulders,\nand merely ask the group for advice.  This is easy for others!  People love giving advice 🎉</p>\n<p>The second phrasing makes it easy for your colleagues to help without asking them to make a decision.\nYou continue to carry the burden of glory/shame if things go well/poorly.</p>\n<h2 id=\"context-vs-control\">Context vs Control<a class=\"headerlink\" href=\"#context-vs-control\" title=\"Permanent link\">&para;</a></h2>\n<p>This feels like the flip-side of Netflix's value, <em>Context vs Control</em>.</p>\n<p>As a manager I work to give folks context so that they can make good decisions\non the ground on their own.  No one wants me micro-managing.  People like\nthis behavior.  People like to control their work.</p>\n<p>However, part of context vs control is that the team member shouldn't give back\ncontrol when the going gets tough.  They should own the hard decisions (taking\nin a lot of input from others of course).  If you're going to ask someone else to make\nthe hard decisions then you should have them do that work directly.</p>\n<ul>\n<li>It sucks not being able to control your own work</li>\n<li>It sucks having to control other work for which you're not on the ground</li>\n</ul>\n<p>Of course, if you're feeling genuinely out of your depth then definitely send\ncontrol (and context) back up the chain of command and ask for different work.</p>\n<h2 id=\"final-thoughts\">Final Thoughts<a class=\"headerlink\" href=\"#final-thoughts\" title=\"Permanent link\">&para;</a></h2>\n<p>I suspect that some people generally agree / find obvious what I wrote above.\nThe one thing I find isn't well understood is the interpretation of these two\ndifferent phrases:</p>\n<ul>\n<li><em>\"What do we want to do?\"</em>  (Burdens the team with the decision)</li>\n<li><em>\"I'm figuring out what to do and could use some advice\"</em>  (Keeps the burden on the asker's shoulders)</li>\n</ul>\n<p>I really like it when people do the second thing.</p>", "image": "https://matthewrocklin.com/assets/images/social/decision-fatigue.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2023-03-18T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/engineers-and-sales/", "url": "https://matthewrocklin.com/engineers-and-sales/", "title": "Listen to Sell", "content_html": "<h1 id=\"listen-to-sell\">Listen to Sell<a class=\"headerlink\" href=\"#listen-to-sell\" title=\"Permanent link\">&para;</a></h1>\n<ul>\n<li><strong>Engineer:</strong> <em>Hey Boss, what should I know to more effectively sell our product?</em></li>\n<li><strong>Boss:</strong> <em>Resist the urge to answer technical questions</em></li>\n</ul>\n<p>I had this brief conversation years ago at an industry conference.\nThis advice has proven invaluable over the years in many contexts\n(including beyond corporate sales)\nand I've re-shared it countless times,\nso I thought I'd write it up.</p>\n<h2 id=\"sales-is-about-listening\">Sales is About Listening<a class=\"headerlink\" href=\"#sales-is-about-listening\" title=\"Permanent link\">&para;</a></h2>\n<p>My then boss (Peter Wang) expanded on his main point</p>\n<p><em>Resist the urge to answer technical questions</em></p>\n<p>To go on to say that as engineers,\nwe always want to show off how something works.\nThis is either out of a need to show that we are knowledgable,\nor just because we like to geek out.</p>\n<p>But we often go too deeply too quickly into a solution\nbefore we fully understand the potential customers' problem.\nThis is almost always a waste of everyone's time.</p>\n<p>So when a customer asks a technical question,\nit's often better to follow up with a question to better understand their situation.\nHere is a small example interaction</p>\n<h3 id=\"bad-engineer-talks-first\">Bad.  Engineer talks first<a class=\"headerlink\" href=\"#bad-engineer-talks-first\" title=\"Permanent link\">&para;</a></h3>\n<ul>\n<li><strong>Customer:</strong> Is your database product fast?</li>\n<li><strong>Bad Engineer:</strong> Yes!  Our combination of advanced algorithms and cluster\n    computing let us scale to very large datasets.\n    Let me tell you about our GPU accelerated join algorithms.</li>\n<li><em>Bad Engineer continues on for a while until customer excuses himself awkwardly</em></li>\n</ul>\n<h3 id=\"good-engineer-listens-first\">Good.  Engineer listens first<a class=\"headerlink\" href=\"#good-engineer-listens-first\" title=\"Permanent link\">&para;</a></h3>\n<ul>\n<li><strong>Customer:</strong> Is your database product fast?</li>\n<li><strong>Good Engineer:</strong> Yes, in many ways, but I'm curious, why do you care\n    about speed?  I see that you work at an insurance company.  Is this for\n    analytics?</li>\n<li><strong>Customer:</strong> No actually.  While we do do lots of analytics, our main need\n    right now is to host queries for our website.</li>\n<li><strong>Good Engineer:</strong> Ah, so you're looking for something like a key-value\n    database with query times under, say, 20ms?</li>\n<li><strong>Customer:</strong> Oh yes, anything under 50ms would be fine really.</li>\n<li><strong>Good Engineer:</strong> OK great.  Yes, we can definitely help you with that.  I\n    normally talk about our GPU accelerated analytics database, but that's\n    actually not a good fit for your use case.  Instead, let me show you our\n    transactionial database product.  I'm less familiar here, but I'm confident\n    that your use case fits right in here.</li>\n</ul>\n<p>Selling is much less about telling people what your product solves,\nand is much more about listening to what problems other people have.\nBy listening you learn a lot about their situation.\nThis gives you a lot of insight into what they care about,\nand helps you to match them to solutions more effectively.</p>\n<h2 id=\"pain-points\">Pain Points<a class=\"headerlink\" href=\"#pain-points\" title=\"Permanent link\">&para;</a></h2>\n<p>Our goal is to discover a customers' pain point,\nand then translate it into technical terms.</p>\n<p>For example their pain point might be that they've been tasked with\nmaking the website faster because customers were dropping off due to long wait\ntimes.</p>\n<p>They've tried to translate this pain point into a set of technical features\n(fast database)\nfor which they are now on the lookout.\nBut they're usually pretty bad at this, and so we need to learn a lot more\nabout them before we know how to help.\nFor example maybe they don't need to invest in a new database product,\nbut instead they just need a progress bar, or better CSS on their webpage.</p>\n<p>If you can discover their pain point then\nyou're much better equipped to solve their problem effectively.\nIf you identify a good product fit at this stage then selling is easy.\nIf you don't then you've avoided a long and fruitless sales process.</p>\n<h2 id=\"summary\">Summary<a class=\"headerlink\" href=\"#summary\" title=\"Permanent link\">&para;</a></h2>\n<p>Selling (or helping people generally) has much more to with learning about them\nand having empathy than it does with talking about what yourself or your\nproduct.</p>", "image": "https://matthewrocklin.com/assets/images/social/engineers-and-sales.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2019-12-05T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/fail-in-public/", "url": "https://matthewrocklin.com/fail-in-public/", "title": "Twitter, LinkedIn, and Failing in Public", "content_html": "<h1 id=\"twitter-linkedin-and-failing-in-public\">Twitter, LinkedIn, and Failing in Public<a class=\"headerlink\" href=\"#twitter-linkedin-and-failing-in-public\" title=\"Permanent link\">&para;</a></h1>\n<p>Twitter is dead. Long live LinkedIn. Well, kinda.</p>\n<p>During Twitter's golden age, I loved seeing people work in public.  We shared half-formed ideas, debugged projects in real-time, and celebrated small wins alongside inevitable setbacks. <strong>Twitter's casual tone made it easier to be vulnerable about the messy nature of work</strong>.  Working in this way felt to me like playing with friends.</p>\n<p>Today on LinkedIn, I mostly see polished announcements: product launches, job promotions, completed milestones. This isn't inherently bad (I've done plenty of self-promotion myself) but <strong>LinkedIn feels emotionally hollow</strong> because we share only the final act.</p>\n<p>We know from every compelling story that <strong>we connect to heroes during their struggles</strong>, not just their victories. The uncertainty, the failed experiments, and the moments of doubt followed by picking yourself up; that's what makes us emotionally invested in someone's eventual success. LinkedIn is like watching only the last 20 minutes of the movie.</p>\n<p>I suspect that this shift reflects broader cultural changes. The stakes today seem higher, and mistakes more costly, both economically and reputationally, so people naturally hedge and default to sharing only their wins.  <strong>The safer it feels to only show success, the more isolated everyone becomes</strong> in their struggles.  Our sense of community and authentic connection depends on our shared vulnerability.  So too does our sense of play.</p>\n<p>One solution is something we can all do more of (myself included), <strong>fail heroically in public.</strong>  We can share more messy ideas, experiments, and failures as they happen.  This requires courage, but I suspect it'll also transform a scary activity into one more resembling play, scraped knees and all.</p>", "image": "https://matthewrocklin.com/assets/images/social/fail-in-public.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2025-07-23T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/failure/", "url": "https://matthewrocklin.com/failure/", "title": "Failure", "content_html": "<h1 id=\"failure\">Failure<a class=\"headerlink\" href=\"#failure\" title=\"Permanent link\">&para;</a></h1>\n<p>Most startups fail, and yet most CEOs project inevitable success.  What gives?</p>\n<p>I can explain this in one of two ways:</p>\n<ol>\n<li>Most CEOs are crazy</li>\n<li>Most CEOs are lying</li>\n</ol>\n<p>It's probably a little bit of both.  CEOs have had some success and expect it\nto continue.  CEOs are also strongly pressured to convey enthusiasm, both to\nthe world and to their employees, even if slightly dishonest.</p>\n<p>This isn't necessarily bad.\nPeople prefer working in a context of promised success.\nFailure and uncertainty are really hard to deal with psychologically.</p>\n<h2 id=\"psychological-cost-of-uncertainty\">Psychological cost of uncertainty<a class=\"headerlink\" href=\"#psychological-cost-of-uncertainty\" title=\"Permanent link\">&para;</a></h2>\n<p>There is a psychological cost to uncertainty or possible failure that someone\nin the organization has to pay.  Either it's ...</p>\n<ol>\n<li>\n<p>The CEO, who swallows that uncertainty, spins it, and lies a little bit to\n    the team, telling everyone that everything will be ok.</p>\n</li>\n<li>\n<p>The team, who accept that their work may fail and deal with it.</p>\n</li>\n</ol>\n<h2 id=\"personal-choice\">Personal Choice<a class=\"headerlink\" href=\"#personal-choice\" title=\"Permanent link\">&para;</a></h2>\n<p>I try to be an honest person.  This isn't due to any kind of ethics; I just\nfind dishonesty to be emotionally very stressful.  I live a better life when I\ndon't hold anything back.</p>\n<p>This often has negative consequences,\nbut overall it filters for colleagues who have a frank and realistic view of the world,\nwhich I appreciate.</p>", "image": "https://matthewrocklin.com/assets/images/social/failure.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2022-09-05T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/fast-review/", "url": "https://matthewrocklin.com/fast-review/", "title": "Small Scope Reviews", "content_html": "<h1 id=\"small-scope-reviews\">Small Scope Reviews<a class=\"headerlink\" href=\"#small-scope-reviews\" title=\"Permanent link\">&para;</a></h1>\n<p>This is a <a href=\"https://matthewrocklin.com/blog/work/2019/06/25/write-short-blogposts\">fast blogpost</a> please excuse the brevity.</p>\n<h2 id=\"summary\">Summary<a class=\"headerlink\" href=\"#summary\" title=\"Permanent link\">&para;</a></h2>\n<ul>\n<li>A fast review and merge cycle is incredibly valuable</li>\n<li>When reviewing, consider highlighting which comments are obligatory because\n    they stop some regression, and which are merely commendable because they\n    would add some enhancement</li>\n<li>Don't forget that better is the enemy of good, especially when prioritizing\n    against all of the other work that can get done.</li>\n</ul>\n<h2 id=\"example\">Example<a class=\"headerlink\" href=\"#example\" title=\"Permanent link\">&para;</a></h2>\n<p>As an OSS developer I use many projects, and when I see a simple problem in a project that I can fix quickly, I like to fix it.\nFor a trivial example, maybe I decide to add a type annotation to a function:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"gd\">-def ensure_bytes(s):</span>\n<span class=\"gi\">+def ensure_bytes(s) -&gt; bytes:</span>\n<span class=\"w\"> </span>    &quot;&quot;&quot; Turn string or bytes to bytes\n\n<span class=\"w\"> </span>    &gt;&gt;&gt; ensure_bytes(&#39;123&#39;)\n<span class=\"w\"> </span>    b&quot;123&quot;\n</code></pre></div>\n<p>Awesome.  This takes me less than two minutes to make the fix and open a pull\nrequest.  I can fire this off and proceed with my normal work.</p>\n<h2 id=\"critical-review\">Critical review<a class=\"headerlink\" href=\"#critical-review\" title=\"Permanent link\">&para;</a></h2>\n<p>On review, someone might helpfully mention that I actually made a mistake, and\nthat this function can also return <code>None</code> in some cases.  They make the\nfollowing suggestion:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"gd\">-def ensure_bytes(s):</span>\n<span class=\"gi\">+def ensure_bytes(s) -&gt; bytes | None:</span>\n<span class=\"w\"> </span>    &quot;&quot;&quot; Turn string or bytes to bytes\n\n<span class=\"w\"> </span>    &gt;&gt;&gt; ensure_bytes(&#39;123&#39;)\n<span class=\"w\"> </span>    b&quot;123&quot;\n</code></pre></div>\n<p>This is great!  They helped me to understand the problem better, and avoid\ndoing something harmful to the project.  The back-and-forth here takes a few\nminutes, and pushing a new commit takes a few minutes, but I'm still happy to\ndo this, and I learned something along the way.  I'm not thrilled about\nstopping my normal work to do this, but it makes total sense.  We need to\nmake sure that things are correct.</p>\n<h2 id=\"non-critical-review\">Non-critical review<a class=\"headerlink\" href=\"#non-critical-review\" title=\"Permanent link\">&para;</a></h2>\n<p>Another reviewer then arrives and suggests that I also type the inputs, and\nchange the docstring to reflect the ambiguous typing.</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"gd\">-def ensure_bytes(s):</span>\n<span class=\"gi\">+def ensure_bytes(s: str | bytes | None) -&gt; bytes | None:</span>\n<span class=\"w\"> </span>    &quot;&quot;&quot; Turn string or bytes to bytes\n\n<span class=\"w\"> </span>    Except if the input is none, in which case it passes through\n\n<span class=\"w\"> </span>    &gt;&gt;&gt; ensure_bytes(&#39;123&#39;)\n<span class=\"w\"> </span>    b&quot;123&quot;\n</code></pre></div>\n<p>This is a good idea!  Someone should do this!  However, I don't think that it\nnecessarily has to be me.  Also, I'm off doing other work, and this is becoming\nmore of a distraction.</p>\n<p>Maybe I do this anyway (it's not hard) but I'm probably less likely to come back here in the future.</p>\n<h2 id=\"distinguish-between-critical-bugs-and-nice-to-have-enhancements\">Distinguish between critical bugs and nice-to-have enhancements<a class=\"headerlink\" href=\"#distinguish-between-critical-bugs-and-nice-to-have-enhancements\" title=\"Permanent link\">&para;</a></h2>\n<p>It's great to make suggestions on PRs for enhancements or how things might be\nimproved.  However, we should always remember to mark them as optional for PR\nauthors.</p>\n<p>We can always come back and add the enhancements ourselves after their\nimprovements are already in.</p>\n<h2 id=\"prioritize-ruthlessly\">Prioritize ruthlessly<a class=\"headerlink\" href=\"#prioritize-ruthlessly\" title=\"Permanent link\">&para;</a></h2>\n<p>However, when we switch out of review mode, and into authoring mode, we might\nrealize that the enhancements aren't actually as important as what we were\nplanning to work on.  If they're not something that we're likely to prioritize\nourselves, then we definitely shouldn't have been requiring someone else to do\nthis work for us.</p>\n<p>This is especially true in a professional context, where time is in short\nsupply.  Many of us come from a volunteer context, where working on code and\nreviewing is a free thing that we ourselves donate or that we do for fun.\nHowever, in a professional context this is often not true, and the\nback-and-forth on a PR has very concrete costs (easily rising into the\nthousands of dollars).  At work we prioritize with our teams to make sure that\nwe're using our time wisely, but we often forget about this prioritization\nprocess when we enter review mode.</p>\n<h2 id=\"parable\">Parable<a class=\"headerlink\" href=\"#parable\" title=\"Permanent link\">&para;</a></h2>\n<p>Imagine that you need to travel from home into the city.  It's a long distance but\na beautiful day outside, and so you decide to walk.  You're moving quickly so\nthat you can get there and back before sunset.</p>\n<p>You start walking swiftly towards your goal, but along the way you spot a piece\nof trash.  You're a good citizen and so you pick up that trash so that you can\nput it in the bin the next time you see one.</p>\n<p>As you approach a trash bin to put the trash away someone stops you and points\nout that this bin was actually for recycling.  They helpfully point you to the\ntrash bin across the road.  You thank the good citizen for stopping you from\nmaking a mistake, and bring the trash to the appropriate place.</p>\n<p>A few folks around the trash bin notice that you're cleaning up the streets,\nand point you to more trash that you can pick up.  That's fine, you're happy to\nhelp out, and so you pick up some more trash to clean up.  They get excited\nabout this and point you down a side road that needs even more cleaning.</p>\n<p>You're not feeling great about this, you need to get to town and back, and\ndaylight is running out.  These kind folks are well meaning, but they've\nmistaken your intent as \"clean up the streets\" rather than \"get to town\".\nYou calmly explain to them that you're not actually here to clean up the\nstreets, explain that you're headed to town to get medicine for your family,\nand that you really must be off.  Now that you've explained your context they\nfully understand your situation and indeed encourage you on your way, perhaps\neven pointing you to a bus line that you didn't know existed.</p>\n<h2 id=\"summary_1\">Summary<a class=\"headerlink\" href=\"#summary_1\" title=\"Permanent link\">&para;</a></h2>\n<p>As we as OSS developers shift to doing professional open source maintenance we\nneed to shift how we think a little.  Open source is amazing at having strong\nimpact, and at collaboration, but often lacks the focus or direction of\nprofessional software engineering shops.  We should think about how we bring\nthe focus of professional work into our open source development practices.</p>\n<p>A great and ubiquitous example of this is PR review, which is a common source\nof scope creep, and often in directions that are not primary foci of the team.</p>\n<p>Fast PRs also feel great, we should do more of those, if we can keep them safe.</p>\n<p><em>Total write time: 21 minutes</em></p>\n<p><em>Total edit and publish time: 2 minutes</em></p>", "image": "https://matthewrocklin.com/assets/images/social/fast-review.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2022-03-26T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/feedback/", "url": "https://matthewrocklin.com/feedback/", "title": "How GitHub taught me to Micromanage", "content_html": "<h1 id=\"how-github-taught-me-to-micromanage\">How GitHub taught me to Micromanage<a class=\"headerlink\" href=\"#how-github-taught-me-to-micromanage\" title=\"Permanent link\">&para;</a></h1>\n<p>Feedback is critical to performing good work as a team.\nGood feedback cultivates quality work and professional growth.\nBad feedback degrades quality and erodes relationships.</p>\n<p>This article explains my experience of feedback in open source community code\nreview, and the culture that emerged from intense detailed feedback.  Then we\nshift to corporate settings and see and how these lessons fail to apply\ncleanly.</p>\n<h2 id=\"open-source-code-reviews\">Open Source Code Reviews<a class=\"headerlink\" href=\"#open-source-code-reviews\" title=\"Permanent link\">&para;</a></h2>\n<p>I first experienced transformative feedback when working in old-school open\nsource communities.  These weren't corporate environments.  These were a bunch\nof volunteers working together to build something awesome used by rest of the\nworld.  There were no managers, no performance reviews, no video meetings, no\nmeetings at all in fact.  There was just the work, and the work was the focus of all\ncommunication.</p>\n<p>The work took three forms:</p>\n<ol>\n<li><strong>Issues:</strong> where we discussed concerns and considered technical designs as a group</li>\n<li><strong>Coding:</strong> where one person would write a solution to the proposed issue</li>\n<li><strong>Code Review:</strong> where anyone could drop in, review the code, and provide feedback.</li>\n</ol>\n<p>Most of the work was in <em>Code Review</em>, not <em>Coding</em> (writing code is a\nvanishingly small fraction software development) and so I spent several hours\nevery day, for years, giving and receiving highly detailed feedback from fellow\ncollaborators.  This is where we taught each other.  This is where we learned\nto align on mission and style.  This is where we expressed humor and learned\nabout each others' character and about our own.</p>\n<p>Let's see an example</p>\n<h2 id=\"example\">Example<a class=\"headerlink\" href=\"#example\" title=\"Permanent link\">&para;</a></h2>\n<p>In this example we see some simple proposed code below, and then consider\nbad/ok/good feedback on that code.</p>\n<p><strong>Proposed code</strong></p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"mi\">0</span>\n<span class=\"k\">for</span> <span class=\"n\">element</span> <span class=\"ow\">in</span> <span class=\"n\">data</span><span class=\"p\">:</span>\n    <span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">x</span> <span class=\"o\">+</span> <span class=\"n\">f</span><span class=\"p\">(</span><span class=\"n\">element</span><span class=\"p\">)</span>\n</code></pre></div>\n<p><strong>Bad Review</strong></p>\n<p><em>Please don't use for loops.  They're hard to understand.  Also please use\ninformative variable names.</em></p>\n<p><strong>OK Review</strong></p>\n<p><em>Please don't use for loops.  They're hard to understand.  Also, please use\ninformative variable names.</em></p>\n<p><em>How about the following?</em></p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"n\">total</span> <span class=\"o\">=</span> <span class=\"nb\">sum</span><span class=\"p\">([</span><span class=\"n\">f</span><span class=\"p\">(</span><span class=\"n\">record</span><span class=\"p\">)</span> <span class=\"k\">for</span> <span class=\"n\">record</span> <span class=\"ow\">in</span> <span class=\"n\">housing_records</span><span class=\"p\">])</span>\n</code></pre></div>\n<p><strong>Good Review</strong></p>\n<p><em>I suggest that we avoid explicit for loops here.  I think that a list\ncomprehension would be a better fit.</em></p>\n<p><em>This is a bit subjective, I find that list comprehensions make it more clear\nto the reader what's going on at a glance because they're a more constrained\nconstruct.  (The same could be said for using <code>map</code>, but I rarely see that\npattern in this codebase).</em></p>\n<p><em>How about this?</em></p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"n\">total</span> <span class=\"o\">=</span> <span class=\"nb\">sum</span><span class=\"p\">([</span><span class=\"n\">f</span><span class=\"p\">(</span><span class=\"n\">record</span><span class=\"p\">)</span> <span class=\"k\">for</span> <span class=\"n\">record</span> <span class=\"ow\">in</span> <span class=\"n\">housing_records</span><span class=\"p\">])</span>\n</code></pre></div>\n<p><em>Now, this practice can definitely get out of hand (I've seen some crazy nested\nlist comprehensions) so there's a tradeoff between using common explicit\ntechnologies like for loops (easy to reason about, but you have to read them)\nand using patterns like list comprehensions (tricky when large, but immediately\nrecognizable if simple). I think that for simple cases like this the tradeoff\nis strongly in favor of the list comprehension.</em></p>\n<p><em>Anecdotally, this is also the norm in this codebase.</em></p>\n<h3 id=\"analysis\">Analysis<a class=\"headerlink\" href=\"#analysis\" title=\"Permanent link\">&para;</a></h3>\n<p>Let's assess each piece of feedback and why I personally think that they're\nbad/ok/good.</p>\n<ul>\n<li>\n<p><strong>Bad feedback</strong> critiques code, but doesn't offer a better direction.</p>\n<p>Critique without constructive direction is just complaining,\nand adds constraint to the author without also helping with momentum.</p>\n</li>\n<li>\n<p><strong>OK feedback</strong> provides direction.</p>\n<p>The reviewer works with the author to produce a better result.</p>\n</li>\n<li>\n<p><strong>Good feedback</strong> educates the author.</p>\n<p>The reviewer works with the author to produce a better result.</p>\n<p>The reviewer works to also improve the author, an investment in their joint future.</p>\n</li>\n</ul>\n<p>The good feedback is thorough, especially given how trivial the code is, and\nespecially given that the new solution and the old solution <em>do the same exact\nthing</em>.  It's not like there was some important bug here.</p>\n<p>The main reason for good feedback is to invest in the author.</p>\n<h2 id=\"role-of-code-review\">Role of Code Review<a class=\"headerlink\" href=\"#role-of-code-review\" title=\"Permanent link\">&para;</a></h2>\n<p>We see then that code reviews serve a few different roles:</p>\n<ol>\n<li>Ensure quality work</li>\n<li>Teach fellow developers</li>\n<li>Align on conventions and process</li>\n</ol>\n<p>Personally, this is how I learned to write code.  This community and practice\nis the reason for my success in career, which has transformed my life.  I am\ngrateful.  This community and practice is also the primary way for me to give\nback to fellow devs around the world.  I can see the impact I and others have\nhad daily in the lives and success of colleagues that I've known for decades.</p>\n<h2 id=\"oss-idiosyncrasies\">OSS Idiosyncrasies<a class=\"headerlink\" href=\"#oss-idiosyncrasies\" title=\"Permanent link\">&para;</a></h2>\n<p>After thinking about this life experience and comparing it to corporate work\n(which I'll get to next), I think that there are some interesting idiosyncrasies\nabout this practice and people that are worth mentioning:</p>\n<ol>\n<li><strong>Craftsmanship:</strong> These people care deeply about their craft</li>\n<li><strong>Volunteerism:</strong> Everyone is a volunteer, spending their personal time on this activity</li>\n<li><strong>Work Focus:</strong> All feedback and conversation is focused on the work,\n    rather than on the person</li>\n<li><strong>Public:</strong> All feedback is fully public</li>\n<li><strong>Respect:</strong> Respect is assumed broadly (we rarely volunteer with people\n    that we don't enjoy)</li>\n</ol>\n<h2 id=\"corporate-contexts\">Corporate contexts<a class=\"headerlink\" href=\"#corporate-contexts\" title=\"Permanent link\">&para;</a></h2>\n<p><em>Why the heck is the CEO correcting my grammar!?</em></p>\n<p>This same approach of highly detailed and thoughtful review does not transfer\nwell to corporate contexts in my experience.  As an example, let's consider the\nfollowing exchange over a google doc:</p>\n<p><img alt=\"\" src=\"../images/google-doc-review.png\" /></p>\n<p>When I first transitioned from OSS dev to CEO at a startup I did <em>lots</em> of review\nlike this.  What I found were questions/concerns/problems like the following\n(all of which are valid in hindsight)</p>\n<ol>\n<li>Why is the CEO correcting my grammar?</li>\n<li>If you want these changes, why not just edit the doc directly?</li>\n<li>This doc isn't high priority. Why do you want to talk about this so much?</li>\n<li>Why do you keep telling me how bad I am at writing?</li>\n</ol>\n<p>These questions confused me.  I realized that it was because that the implicit\nmessage received behind my feedback was very different.</p>\n<h2 id=\"implicit-messages\">Implicit messages<a class=\"headerlink\" href=\"#implicit-messages\" title=\"Permanent link\">&para;</a></h2>\n<p>There was a major difference in the implicit message that is being received in\nthe first open source case than in the second corporate case.</p>\n<ul>\n<li>\n<p><strong>Open Source:</strong> <em>I believe in you and your work.  I see potential for you to\n   get even better at your craft and would be proud to invest my time to see that happen.</em></p>\n</li>\n<li>\n<p><strong>Corporate:</strong> You're doing a bad job.  I'm going to explain, in minute\n   detail, exactly what you did wrong, over and over again because I hate you\n   and want you to suffer.</p>\n</li>\n</ul>\n<p>What before was a supportive behavior is now an abusive one.\nEverything depends on context.</p>\n<p><em>Note: to be clear, this miscommunication isn't the receiever's fault.  We as\nreviewers need to better model our context so we can anticipate how\nfeedback will be received.</em></p>\n<h2 id=\"corporate-mindset\">Corporate Mindset<a class=\"headerlink\" href=\"#corporate-mindset\" title=\"Permanent link\">&para;</a></h2>\n<p>This negative reception feels more reasonable when you consider the mindset and\ncontext in which this work is done.  Referring back to the OSS Mindset above,\nlet's compare with corporate.</p>\n<ul>\n<li><strong>Honing a craft:</strong> in old-school community OSS people cared <em>a lot</em> about\n   getting better at development.  Micro-adjustments to our form were really\n   valuable to us.  Development skill was a big part of our (or at least my) self-identity.</li>\n</ul>\n<p>Conversely in corporate few people care as deeply about the craft of\n   writing, meeting facilitation, graphic design, etc..  Skillbuilding is nice,\n   but it's secondary to getting work done.  The assumption is that feedback is\n   primarily focused on the job at hand, rather than on building our teammates.</p>\n<ul>\n<li>\n<p><strong>Assumed Respect:</strong> in volunteer OSS if people don't like you they just ignore you.\n    Anyone reviewing your work is doing so because they care and want to help\n    you.</p>\n<p>This doesn't hold in a corporate environment, where people are paid to help\nwhether or not they like you.</p>\n</li>\n</ul>\n<p>This does beg the question though, what would a corporate environment look like\nwhere people cared deeply about things like meeting facilitation and slide\ndesign?  Probably the company would go quickly out of business, but it's a fun\nthought to consider, and maybe apply a little bit of in our everyday life.</p>\n<h2 id=\"feedback-reception-budget\">Feedback Reception Budget<a class=\"headerlink\" href=\"#feedback-reception-budget\" title=\"Permanent link\">&para;</a></h2>\n<p>And so, I've learned that a person can absorb only about one piece of feedback\nper interaction, and then only if it's labeled very specifically as feedback\nwith the best intentions, and wrapped delicately in a feedback sandwich.</p>\n<p>Because of this volume constraint, infrequent feedback must be more general and\nhigher level, ideally accompanied by impersonal assets like a blogpost that the\nrecipient of the feedback can read separately (this is partially why I write\nblogposts).</p>\n<h2 id=\"but-please\">But please ...<a class=\"headerlink\" href=\"#but-please\" title=\"Permanent link\">&para;</a></h2>\n<p>For the love of god ...</p>\n<ul>\n<li>Remove filler words like \"really\", \"very\" or anything else that doesn't change\n   the meaning of a sentence</li>\n<li>Do not start meetings by asking everyone to introduce themselves</li>\n<li>Attach agendas to meetings ahead of time</li>\n<li>When making slides think about text contrast and use alignment guide-lines</li>\n</ul>\n<p>Thanks for listening, hopefully this article ...</p>\n<ol>\n<li>Helps people around me understand the implicit message behind my feedback</li>\n<li>Gives everyone desiring a spirit of craftsmanship more interest in\n    developing a strong culture of constant constructive feedback</li>\n</ol>", "image": "https://matthewrocklin.com/assets/images/social/feedback.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2024-05-11T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/hammers-and-nailguns/", "url": "https://matthewrocklin.com/hammers-and-nailguns/", "title": "Hammers and Nailguns", "content_html": "<h1 id=\"hammers-and-nailguns\">Hammers and Nailguns<a class=\"headerlink\" href=\"#hammers-and-nailguns\" title=\"Permanent link\">&para;</a></h1>\n<p>People often ask me, <em>\"What is your tool for?\"</em></p>\n<p>They want an answer like \"AI\" or \"ETL\" or \"Training Models\". <br/>\nThey want a clean and specific application for easy comparison.</p>\n<p>I, of course, do not give them that satisfaction.<br/>\nInstead I ask <em>\"What is Python for?\"</em> or <em>\"What is the cloud for?\"</em></p>\n<p><strong><em>Them:</em></strong> <em>Well, all sorts of different things.</em><br/>\n<strong><em>Me:</em></strong> <em>Exactly!</em></p>\n<p>Unfortunately, this answer sucks.</p>\n<h2 id=\"simple-tools-humble-opinions\">Simple Tools, Humble Opinions<a class=\"headerlink\" href=\"#simple-tools-humble-opinions\" title=\"Permanent link\">&para;</a></h2>\n<p>The analogy I use here is of hammers and nailguns.</p>\n<p><img alt=\"\" src=\"../images/hammer-nailgun.webp\" width=\"60%\" /></p>\n<p>Nominally these tools do the same thing (nail things) <br/>\nIn reality they do very different things:</p>\n<ul>\n<li>\n<p><strong>The nail gun puts nails into wood.</strong>  The nailgun is 10x better than a hammer at doing this.  If we have to nail 1000 nails then we should definitely get a nail gun.</p>\n</li>\n<li>\n<p><strong>The hammer whacks things.</strong>  Those things can be nails, but they can also be wrenches, or rusty bolts, or drywall, or heck, even a zombie’s head.</p>\n</li>\n</ul>\n<p>I own a hammer, not a nailgun.  I use it for all sorts of things (most recently\nto tap in drywall anchors).  I can’t recall the last time I actually nailed\nsomething with it.  Nailguns are better at nailing things, but it’s rare that\nthat’s exactly what I want.  Nailguns make enough assumptions about what I want\nto do that they’re rarely the right tool for me.  The hammer's design is more\n<em>humble</em>; it doesn't assume much about how I want to use it.</p>\n<p>Home improvement, like Python, is a place where all sorts of strange problems\narise, and it’s great to have simple and flexible tools that extend our natural\nabilities (like whacking things) in any situation.</p>\n<h2 id=\"nailguns-are-easier-to-market\">Nailguns are easier to market<a class=\"headerlink\" href=\"#nailguns-are-easier-to-market\" title=\"Permanent link\">&para;</a></h2>\n<p>Writing copy for nailguns is easy</p>\n<p><strong><em>Nailguns:</em></strong> <em>\"Sink nails 10x faster, save time and energy!\"</em></p>\n<p>Hammers are harder</p>\n<p><strong><em>Hammers:</em></strong> <em>\"Whack things!  So useful!\"</em></p>\n<p>Hammers have more applications and are far more commonly used.\nHowever the lack of a single \"killer application\" (just thousands of mundane\nones) makes them awkward to pitch successfully.</p>\n<h2 id=\"i-like-hammers\">I Like Hammers<a class=\"headerlink\" href=\"#i-like-hammers\" title=\"Permanent link\">&para;</a></h2>\n<p>As a craftsman (in both wood and code) I like hammers.  Hammers extend our\nnatural abilities just a little (naturally our bodies know how to hit things,\njust not as hard).  Hammers fit in our hands, are simple, and are intuitive to\nuse in any situation.</p>\n<p>We especially need hammers in unpredictable situations, which is exactly where\nPython data devs live.  Python devs are the tip of an organizations\nproblem-solving spear.  They always get asked to tackle the wacky new dataset\nor computational method.  Their problems are often novel and untested.  Of\ncourse for any problem we would prefer a purpose built tool, but the market\nrarely responds to our needs that quickly, and by the time it does it's usually\nsomeone else's problem.</p>\n<p>Simple tools with humble opinions like hammers are what I reach for when I\nface a new problem.  They're difficult to justify in words, but they're always\neasy to use and effective at getting the job done.</p>", "image": "https://matthewrocklin.com/assets/images/social/hammers-and-nailguns.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2025-01-06T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/hiring-sales/", "url": "https://matthewrocklin.com/hiring-sales/", "title": "Hiring Sales", "content_html": "<h1 id=\"hiring-sales\">Hiring Sales<a class=\"headerlink\" href=\"#hiring-sales\" title=\"Permanent link\">&para;</a></h1>\n<p>We're relaunching our enterprise sales effort after improving product-market\nfit.  However, it's an interesting challenge finding just the right person.\nThis post goes into a bit of our history, what we're looking for in an early\nsales hire, and my experience engaging with this process.</p>\n<p>This post may interest you if ...</p>\n<ol>\n<li>You're interviewing with me and I've pointed you to this post</li>\n<li>You're curious about startups generally</li>\n<li>You want to recommend someone in your network (please do!)</li>\n</ol>\n<h2 id=\"history\">History<a class=\"headerlink\" href=\"#history\" title=\"Permanent link\">&para;</a></h2>\n<p>A couple years ago we had a sales team, but our product was bad and so the\nsales team was premature.  We fired them (and a bunch of other people) and\nfocused on making a delightful product.</p>\n<p>Then, because we didn't have a sales team we focused on making a product that a\nuser could on-board, use, and pay for all without talking to us.  Surprisingly,\nthis worked, and today we have a nice machine that generates happy champions\nwithin small teams that pay low thousands of dollars per month (but rarely\nmore).</p>\n<p>These people pay us money, but not that much.  We've been encouraged by two\nrecent learnings:</p>\n<ol>\n<li>A little bit of customer support as they onboard greatly accelerates consumption</li>\n<li>After talking to customers, we realize that there are often much larger\n    opportunities just behind the initial team that lands with us.</li>\n</ol>\n<p>Given this, we're hiring a sales team again.  This should be a fun opportunity\nfor early-stage-oriented sales folks because ...</p>\n<ol>\n<li>\n<p><strong>We have a solid pipeline of inbound leads.</strong></p>\n<p>Our product mints new champions regularly.</p>\n</li>\n<li>\n<p><strong>Our current sales numbers suck</strong>, mostly because we haven't done anything.</p>\n<p>It's a great opportunity for someone to say \"I was the first salesperson on\nthe ground and took them from $0 to $N million in two years\" which is a\ngreat way for someone to graduate from AE/SE to VP of Sales in their next\nposition (or this one) and maximize lifetime income.</p>\n</li>\n</ol>\n<h2 id=\"team-composition\">Team Composition<a class=\"headerlink\" href=\"#team-composition\" title=\"Permanent link\">&para;</a></h2>\n<p>Ideally we want people who have three skills:</p>\n<ol>\n<li>\n<p><strong>Know how to sell</strong></p>\n<p>Know how to empower champions, navigate an org chart, find economic\nbuyers, identify pain and goals, speak to that pain and those goals,\nnegotiate with precurement and legal, etc..</p>\n</li>\n<li>\n<p><strong>Know our space</strong> (data infrastructure, open source, Python)</p>\n<p>Familiar with Python/Spark/Cloud/Devops/Data/ML/...  So for example when\nsomeone says that they're having trouble with some technology, say Argo,\nknow that that means \"workflow management\" and direct them to the right\nsolution within our product.</p>\n<p>There's a lot of incidental complexity here that takes a while to learn.</p>\n</li>\n<li>\n<p><strong>Are intellectually curious</strong>, comfortable in startups,  and excited to be\n    creative and invent new systems</p>\n<p>There's really nothing in place to define how to do the job.  Hopefully\nthis excites rather than scares you.  Also, we have a distinct\ncommunication style (direct, critical, thoughtful) and hopefully you click\nwith that.</p>\n</li>\n</ol>\n<p>This person probably doesn't exist, so we'll happily settle for two out of\nthree, and we'll just build a team to round things out.  Probably this team\nlooks a little like ...</p>\n<ul>\n<li>Account Executive</li>\n<li>Sales Engineer</li>\n<li>Field Engineer</li>\n</ul>\n<h2 id=\"interviewing-aes-is-hard\">Interviewing AEs is Hard<a class=\"headerlink\" href=\"#interviewing-aes-is-hard\" title=\"Permanent link\">&para;</a></h2>\n<p>We've got good candiates for Field and Sales Engineers.  AEs are harder for us\nto connect to though.  There are lots of great candidates out there, but it's\nbeen harder to come to a sense of conviction with an AE so far.</p>\n<p>My experience interviewing AEs so far has been that they say fairly generic\nthings like:</p>\n<ul>\n<li>I'll succeed by finding the buyer, figuring out what their pain is, and then\n   demonstrating how we solve that pain</li>\n<li>I did this with big name company X, where I built the relationship over many\n   months, and built the deal to $X million</li>\n<li>We should sell where the money is</li>\n<li>...</li>\n</ul>\n<p>Everyone says these things, and while I wholeheartedly agree with these points,\nthey don't differentiate a candidate, and they don't say anything specific\nabout our situation.   My assumption is that <a href=\"../think/\">early stage startups are\ndifferent from each other</a>, and that what works for one is unlikely to\ntransfer to another automatically.</p>\n<p>So, AEs that I interview, here's the cheat code:</p>\n<ul>\n<li>\n<p>Assume that I know more about sales than a typical engineer\n    (you can save time by not explaining basic concepts)</p>\n</li>\n<li>\n<p>Get to a point in our conversation where we are conversing about strategy\n    at a non-generic level.</p>\n<p>To do this you will likely need to ...</p>\n<ul>\n<li>Become a lot smarter about our situation pretty quickly,\n    this probably means asking questions that are useful to you</li>\n<li>Pause ... and think</li>\n</ul>\n</li>\n<li>\n<p>If it looks like I want to say something, notice, and open some space.\n    I'm very interested in how well we can communicate.</p>\n</li>\n</ul>\n<p>The number of otherwise qualified AEs that come in and give the impression that\nthey have all the answers (despite not knowing much about our situation) is odd\nto me.  My <em>guess</em> is that they're assuming that I'm looking for someone to say\n\"everything's going to be ok, I've got this\" convincingly enough and so that's\ntheir main/only message. However, to me saying that with conviction but without\nunderstanding our situation is a strongly negative signal.</p>\n<p>What I'm actually looking for is someone who can demonstrate that they're able\nto think and solve my problem specifically, not today, but over many months\nafter failing quickly many times and thinking through new strategies.  My\nassumption is that any answer you have today is likely wrong, so if you have\nstrong conviction on that answer I'll probably assume that you're mentally\ninflexible.</p>\n<h2 id=\"faqs\">FAQs<a class=\"headerlink\" href=\"#faqs\" title=\"Permanent link\">&para;</a></h2>\n<p>To accelerate the interview process a bit, here are some frequently asked\nquestions by sales folks:</p>\n<ul>\n<li>\n<p><strong>Q:</strong> What is your runway?</p>\n<p><strong>A:</strong> We have two-ish years of runway, assuming we don't make any money</p>\n</li>\n<li>\n<p><strong>Q:</strong> What are your goals?</p>\n<p><strong>A:</strong> I'd love to get to $5mm ARR in that time (but you tell me what you\nthink is feasible, and we'll adjust strategy together) probably with a\nmixture of small and large deals.</p>\n</li>\n<li>\n<p><strong>Q:</strong> How much room is there to grow?  (could I end up managing sales?)</p>\n<p><strong>A:</strong> Yes, if you're good.  I don't promise anything though.\nHonestly, if you're really good then you can have my job :)</p>\n</li>\n</ul>", "image": "https://matthewrocklin.com/assets/images/social/hiring-sales.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2024-04-29T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/interviews/", "url": "https://matthewrocklin.com/interviews/", "title": "How I Conduct an Interview", "content_html": "<h1 id=\"interviews\">Interviews<a class=\"headerlink\" href=\"#interviews\" title=\"Permanent link\">&para;</a></h1>\n<p>Interviewing is hard.  It's also important to do well.</p>\n<p>A good/bad match can be transformative/terrible for both the company and the\ncandidate.  This article describes my current approach.  It may be useful for\nothers who are conducting interviews, or for people who plan to interview with\nme (transparency is good).</p>\n<p>My interviews are typically in 45 minute calendar slots.\nAfter saying \"hi\" and being friendly for a minute or two I lead the\nconversation through the following stages:</p>\n<h2 id=\"i-talk-about-the-company-and-what-were-looking-for\">I talk about the company and what we're looking for<a class=\"headerlink\" href=\"#i-talk-about-the-company-and-what-were-looking-for\" title=\"Permanent link\">&para;</a></h2>\n<p><em>This typically takes five minutes</em></p>\n<p>First, I give information about the company, the teams within the company and\nwhere we think the candidate might fit, and what kinds of candidates we think\nwork well with us.</p>\n<p>In our case I say things like the following ...</p>\n<ul>\n<li>\n<p>We're a commercial company based around the open source Dask project</p>\n</li>\n<li>\n<p>Engineering-wise we do two things</p>\n<ul>\n<li>Work on Dask and push it forward</li>\n<li>Build a cloud SaaS deployment platform</li>\n</ul>\n<p>Given your background, we think that you're a good fit for one or the\nother, but our most impactful folks end up being able to cross both.</p>\n</li>\n<li>\n<p>Historically we've found that we work well with senior engineers who are\n    professional (can deliver things on time, even in complex situations), know\n    open source culture, but also care about commercialization (we're a\n    for-profit company and culturally lean into that).  This is what we're\n    looking for.</p>\n</li>\n</ul>\n<p>On the last bit I like to be explicit.  People need to opt-in to both our\nstrengths and our constraints:</p>\n<ul>\n<li><strong>Seniority:</strong> we're bad at management and don't mentor people well when they're early in their careers</li>\n<li><strong>Professionalism:</strong> there are so many interesting problems around us that it's\n    easy to get distracted (we all suffer from this).  We prefer important work\n    to interesting work, prioritize intentionally, and feel good about setting\n    commitments and working to timelines.  This is typically hard for academics.</li>\n<li><strong>Commercial OSS:</strong> we believe in the power of open source communities.  We\n    also understand their limitations.  We are excited about commercial impact\n    and and using that energy to both make money and have social impact.</li>\n</ul>\n<p>There are <em>very good people</em> who don't fit that culture.  We like to be explicit\nto avoid mismatches.  Alignment is good for anyone.</p>\n<h2 id=\"learn-more-about-the-candidate\">Learn more about the candidate<a class=\"headerlink\" href=\"#learn-more-about-the-candidate\" title=\"Permanent link\">&para;</a></h2>\n<p><em>This typically takes twenty minutes</em></p>\n<p>Next, it's time to figure out if the candidate knows what they're talking\nabout.  There are many ways to do this, none of which are particularly good.</p>\n<p>Personally, I like to ask them what they know about us and if they have\nrelevant experience.  I then like to dig into that experience and test\ndifferent situations to probe a bit.</p>\n<ul>\n<li>Interviewer: \"Have you used Dask or anything like it before?\"</li>\n<li>Candidate: \"I haven't, but I did use Spark at my last job\"</li>\n<li>Interviewer: \"Oh cool, what did you use it for?\"</li>\n<li>Candidate: \"We did a lot of machine learning and AI\"</li>\n<li>\n<p>Interviewer: \"Oh interesting, what kinds of models were you training?\"</p>\n<p><em>Get to probe their understanding of technical work</em>\n-   Candidate: \"We tried using XGBoost, but really most of it was logistic regression\"\n-   Interviewer: \"I'm curious, I don't know much about this field, but my understanding is that it's commonly better to just sample and train locally.  Why use distributed computing at all?\"</p>\n<p><em>See how they react to a challenge.  See their ability to critically analyze their own directions</em>.</p>\n</li>\n<li>\n<p>...</p>\n</li>\n<li>\n<p>Interviewer: \"Why were you training these models?\"</p>\n<p><em>Probe their understanding of how their work affects the rest of the\nbusiness</em></p>\n</li>\n<li>\n<p>...</p>\n</li>\n</ul>\n<h2 id=\"candidate-asks-questions-of-us\">Candidate asks questions of us<a class=\"headerlink\" href=\"#candidate-asks-questions-of-us\" title=\"Permanent link\">&para;</a></h2>\n<p>My usual line here is \"I have a couple more questions to ask, but first, do you\nhave any questions for us?\"</p>\n<p>What they ask here is telling.  Sometimes people are ask generic questions. These look like the following:</p>\n<ol>\n<li>What are your biggest challenges?</li>\n<li>How is company culture?</li>\n<li>Where do you see yourself in five years?</li>\n</ol>\n<p>More informed candidates usually have more specific questions for us:</p>\n<ol>\n<li>How are you balancing between the cloud platform and OSS work?  Are those\n    teams siloed?  Is there space to work on both?</li>\n<li>Tech companies are in a bad way these days.  How secure is my job here?</li>\n<li>I'm really interested in application X.  Is that something that there would\n    be space to work on while here?</li>\n</ol>\n<p>Often I'm not judging them at this point.  I'm probably trying to sell them.\nIt's good and healthy to have the tables turned.  Interviewing is\nbi-directional in any good relationship.</p>\n<h2 id=\"logistics-questions\">Logistics questions<a class=\"headerlink\" href=\"#logistics-questions\" title=\"Permanent link\">&para;</a></h2>\n<p>At the end I keep about five minutes to ask the following:</p>\n<ol>\n<li>\n<p><strong>What's your risk tolerance?</strong></p>\n<p>Mostly I'm trying to scare them:</p>\n<p><em>We're an early stage startup.  We're not shy about changing direction.  We have a history of firing people.\nYou seem great and we're picky about who we bring on,\nbut we like to be upfront about the possibility of separation.</em></p>\n<p><em>Typically people in this space can get a new job within our typical\nseverance period (one month historically) but are you comfortale with this\nsort of dynamic?</em></p>\n</li>\n<li>\n<p><strong>What are your payment expectations?</strong></p>\n<p>This is an awkward conversation to bring up.  My usual phrasing is\nsomething like the following:</p>\n<p><em>You can totally pass on this next question, but roughly what your are you looking to make here salary-wise.</em></p>\n<p><em>The reason I ask is that we've gone through interview cycles with\ncandidates only to find, at the end, that they're expecting $300k+, and\nwe're nowhere near that.  I just want to make sure that we're somewhere in\nthe same neighborhood.</em></p>\n<p>I then wait a bit, and typically the candidate either ...</p>\n<ol>\n<li>Just tells me what they're making now</li>\n<li>Gives a general range for what they'd expect someone in this role could make</li>\n<li>Does a hard-pass (although this is surprisingly rare)</li>\n</ol>\n<p>Most often there is also a conversation at this point about equity,\nvacation expectations, other benefits, which is good to have.  I'm also\nopen to sharing a broad distribution of what our engineers make.</p>\n</li>\n<li>\n<p><strong>Possible start date</strong></p>\n<p>Some folks have long notice periods (looking at you Europeans) others just\ngot let go and want to start next week.</p>\n</li>\n</ol>\n<h2 id=\"next-steps\">Next steps<a class=\"headerlink\" href=\"#next-steps\" title=\"Permanent link\">&para;</a></h2>\n<p>If I'm leading the process I'll maybe mention a few folks that I'm going to\nwant them to meet.  If I'm not leading the process I say \"I'm going to share my\nnotes with the team and the person who's leading this process should get back\nto you shortly after your last interview\".</p>\n<h2 id=\"timing\">Timing<a class=\"headerlink\" href=\"#timing\" title=\"Permanent link\">&para;</a></h2>\n<p>Speed is key.  Especially in tech.  Especially in startups.  Sometimes we're\ngreat at this.  Sometimes we're terrible.  It's always something to work on.\nSome tips:</p>\n<ol>\n<li>Early-reachout once they apply, if only to acknowledge the application</li>\n<li>Panel interviews with lots of folks at once</li>\n<li>Pre-schedule a meeting with the interviewing team for right after their\n    last interview</li>\n</ol>", "image": "https://matthewrocklin.com/assets/images/social/interviews.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2023-01-06T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}, {"id": "https://matthewrocklin.com/introducing-claude-chic/", "url": "https://matthewrocklin.com/introducing-claude-chic/", "title": "Claude Chic", "content_html": "<h1 id=\"introducing-claude-chic\">Introducing Claude Chic<a class=\"headerlink\" href=\"#introducing-claude-chic\" title=\"Permanent link\">&para;</a></h1>\n<p><a href=\"/claudechic\">Claude Chic</a> is an alternative Claude Code UI that provides the following:</p>\n<ul>\n<li><a href=\"#1-style\"><strong>Style:</strong></a> visually organizes the message stream for legibility</li>\n<li><a href=\"#git-worktrees\"><strong>Git Worktrees:</strong></a> organizes concurrent worktrees</li>\n<li><a href=\"#multiple-agents\"><strong>Multiple Agents:</strong></a> runs many sessions from the same window</li>\n<li><a href=\"#quality-of-life\"><strong>Quality of Life:</strong></a> loads of other features like diff viewer, shell commands, and more</li>\n</ul>\n<p>The official docs are <a href=\"/claudechic\">here</a>, but I wanted to share my personal motivation and experience building this.</p>\n<p>Or, if you prefer to jump right in, Claude Chic can explain itself:</p>\n<div class=\"highlight\"><pre><span></span><code>uvx<span class=\"w\"> </span>claudechic<span class=\"w\"> </span>/welcome\n</code></pre></div>\n<video src=\"https://github.com/user-attachments/assets/bbdae8ac-9ddb-455b-8282-b52cfb73c4e8\" autoplay loop muted playsinline style=\"max-width: 100%\"></video>\n\n<h2 id=\"0-motivation\">0. Motivation<a class=\"headerlink\" href=\"#0-motivation\" title=\"Permanent link\">&para;</a></h2>\n<p>I've been deep in AI joy/psychosis the last couple months.  The world is super fun right now.</p>\n<p>However, as AI speeds up my workflow I find new bottlenecks, and increasingly those bottlenecks are part of my interactions with Claude itself.  I wrote about this in <a href=\"/ai-zealotry\">AI Zealotry</a>; AI can feel dehumanizing when our primary contribution is administrative, like granting permission.</p>\n<p>Beyond permissions, various administrative interactions with Claude became tiresome, and so I worked to improve what I could about the interface for my workflow so that I could feel more human.</p>\n<p>Claude Chic is an early result of that endeavor.</p>\n<h2 id=\"1-style\">1. Style<a class=\"headerlink\" href=\"#1-style\" title=\"Permanent link\">&para;</a></h2>\n<p>Let's start with visual design.  Claude is functionally great, but stylistically pretty terrible.</p>\n<p>Here's a screenshot of Claude Code:</p>\n<p><img alt=\"Claude Code\" src=\"https://github.com/user-attachments/assets/e6caa10a-0696-43f3-a1f3-10d9f620a389\" style=\"max-width: 100%\" /></p>\n<p>I find this difficult to parse.  Everything feels muddled:</p>\n<ul>\n<li><strong>No visual distinction</strong> between messages</li>\n<li><strong>Too wide</strong> for comfortable reading (moreso in full-screen)</li>\n<li><strong>Lost information</strong> - I want to dig into edits before they get summarized away</li>\n</ul>\n<p>We don't expect modern design in terminal applications, but maybe we should, especially with <a href=\"https://textual.textualize.io/\">Textual</a>.</p>\n<p>Textual made it easy to design a skin for Claude code that was, for me, much easier to consume.</p>\n<h3 id=\"comparison\">Comparison<a class=\"headerlink\" href=\"#comparison\" title=\"Permanent link\">&para;</a></h3>\n<p>To me, Claude Code looks muddled.</p>\n<div class=\"tabbed-set tabbed-alternate\" data-tabs=\"1:2\"><input checked=\"checked\" id=\"__tabbed_1_1\" name=\"__tabbed_1\" type=\"radio\" /><input id=\"__tabbed_1_2\" name=\"__tabbed_1\" type=\"radio\" /><div class=\"tabbed-labels\"><label for=\"__tabbed_1_1\">Claude Code</label><label for=\"__tabbed_1_2\">Claude Chic</label></div>\n<div class=\"tabbed-content\">\n<div class=\"tabbed-block\">\n<p><img alt=\"Claude Code\" src=\"https://github.com/user-attachments/assets/e6caa10a-0696-43f3-a1f3-10d9f620a389\" style=\"width: 100%\" /></p>\n</div>\n<div class=\"tabbed-block\">\n<p><img alt=\"Claude Chic\" src=\"https://github.com/user-attachments/assets/229f3904-4dee-4f97-8fc7-d65fb78ac9cd\" style=\"width: 100%\" /></p>\n</div>\n</div>\n</div>\n<p>To me, Claude Chic organizes the conversation so my eyes can parse it immediately without feeling drowned.</p>\n<p>Tool use in particular is interesting.  There are <em>more</em> tool use lines in the Chic version (Claude code omits many tool use lines), but they don't get in the way, and each is expandable for full context.</p>\n<p>Additionally, Markdown renders properly.</p>\n<div class=\"tabbed-set tabbed-alternate\" data-tabs=\"2:2\"><input checked=\"checked\" id=\"__tabbed_2_1\" name=\"__tabbed_2\" type=\"radio\" /><input id=\"__tabbed_2_2\" name=\"__tabbed_2\" type=\"radio\" /><div class=\"tabbed-labels\"><label for=\"__tabbed_2_1\">Claude Code</label><label for=\"__tabbed_2_2\">Claude Chic</label></div>\n<div class=\"tabbed-content\">\n<div class=\"tabbed-block\">\n<p><img alt=\"Claude Code expanded\" src=\"https://github.com/user-attachments/assets/c09c35af-8f62-417e-b7d9-f9bc0f78070a\" style=\"width: 100%\" /></p>\n</div>\n<div class=\"tabbed-block\">\n<p><img alt=\"Claude Chic expanded\" src=\"https://github.com/user-attachments/assets/ebdee1a5-9700-4149-8e97-1fbe420852ca\" style=\"width: 100%\" /></p>\n</div>\n</div>\n</div>\n<p>Key styling choices:</p>\n<ol>\n<li><strong>Color:</strong> User (orange), Claude (blue), Tools (grey)</li>\n<li><strong>Expansion:</strong> Tool messages collapse by default, click to expand</li>\n<li><strong>Width:</strong> Constrained to 100 characters</li>\n<li><strong>Markdown:</strong> Proper rendering</li>\n<li><strong>Streaming:</strong> Responses appear as they generate</li>\n</ol>\n<p>To be honest, this ended up being a deeper rabbit hole than I anticipated.  Totally worth it though.  We're still early (definitely beta software), but it feels much better to me than Claude's default interface, or similar tools like Codex, Gemini, and other CLI tools.  Everyone should be using Textual for TUIs.</p>\n<h2 id=\"2-git-worktrees\">2. Git Worktrees<a class=\"headerlink\" href=\"#2-git-worktrees\" title=\"Permanent link\">&para;</a></h2>\n<p>Git worktrees are underused.  They let multiple Claude agents work on the same repository in parallel.</p>\n<p>Unfortunately, none of us know how they work.  People I've spoken to have all seen an article or Youtube video showing them in action, but in practice they feel foreign.  That's ok; AI tooling is great at foreign workflows.</p>\n<h3 id=\"user-experience\">User Experience<a class=\"headerlink\" href=\"#user-experience\" title=\"Permanent link\">&para;</a></h3>\n<p>Previously, when I had a new idea it went on a TODO list while Claude finished its current task.  Ideas would linger on that TODO list for a <em>long</em> time, even simple and easy ones.  Coordinating the shared resource of the repository was an annoying bottleneck.</p>\n<p>Git worktrees solve this by marrying a git branch with a fresh copy of the repository directory.</p>\n<div class=\"highlight\"><pre><span></span><code>~/projects/\n├── myrepo/            # Main worktree (main branch)\n├── myrepo-feature-1/  # Some feature you&#39;re working on\n├── myrepo-feature-2/  # Some feature you&#39;re working on\n├── ...\n└── myrepo-feature-n/  # Some feature you&#39;re working on\n</code></pre></div>\n<p>Now you can have <code>n</code> Claude agents working, one in each directory.  When I have a new idea, I create a new worktree and have Claude start on it immediately:</p>\n<div class=\"highlight\"><pre><span></span><code>/worktree my-idea\n\nI want you to explore ...\n</code></pre></div>\n<p>This creates a new worktree (directory + branch) and a new agent working in that directory in the background.  The agent starts working concurrently while I go back to my main task.  In practice I have 2-10 of these going at once.</p>\n<p>Now I focus on whatever ongoing thread interests me most while Claude pushes the others forward.  I no longer wait for Claude; Claude waits for me.</p>\n<h3 id=\"cleaning-up\">Cleaning up<a class=\"headerlink\" href=\"#cleaning-up\" title=\"Permanent link\">&para;</a></h3>\n<p>With concurrent git development comes conflicts.  To address this, my git flow looks like the following:</p>\n<ol>\n<li><strong>Commit</strong> work in a branch</li>\n<li><strong>Rebase</strong> Rebase on our upstream branch (for linear history)</li>\n<li><strong>Resolve</strong> any conflicts</li>\n<li><strong>Fast-forward merge</strong> branch into upstream</li>\n<li><strong>Delete</strong> worktree</li>\n</ol>\n<p>Claude handles rebases and conflicts fine (and asks when it can't), so the workflow above got baked into the <code>/worktree finish</code> command.  Concurrent git managemet is, for me, fully managed now.</p>\n<p>Now that all of my TODO items can run at once, worktrees shift the decision from \"what thread should we start next?\" to \"which ongoing session most deserves my attention?\"  This decision, coming later in the workflow, comes with more and richer information.</p>\n<h2 id=\"3-multiple-agents\">3.  Multiple Agents<a class=\"headerlink\" href=\"#3-multiple-agents\" title=\"Permanent link\">&para;</a></h2>\n<p>Multiple agents run concurrently in one session and can talk to each other.  Here they play chess:</p>\n<video src=\"https://github.com/user-attachments/assets/735ebc91-335e-4476-8fde-f49ce1df056a\" autoplay loop muted playsinline style=\"max-width: 100%\"></video>\n\n<p>This is a cute demo, but in practice I use multiple agents with prompts like the following:</p>\n<ul>\n<li><strong>Reviewing:</strong> \"Start an agent to review our changes critically\"</li>\n<li><strong>Research:</strong> \"Start an agent to explore this topic further\"</li>\n<li><strong>Dogfooding:</strong> Recently when adding a profiler, I spawned an agent to use it and suggest improvements back to the agent building it</li>\n</ul>\n<p>There are intense multi-agent systems out there like <a href=\"https://steve-yegge.medium.com/welcome-to-gas-town-4f25ee16dd04\">Gas Town</a> and <a href=\"https://github.com/code-yeongyu/oh-my-opencode\">OhMyOpenCode</a>.  I haven't needed that level of automation yet, but I find this space interesting.</p>\n<h2 id=\"4-quality-of-life\">4. Quality of Life<a class=\"headerlink\" href=\"#4-quality-of-life\" title=\"Permanent link\">&para;</a></h2>\n<p>Claude Chic comes with myriad other niceties like a <code>/diff</code> viewer, vim keybindings (<code>/vim</code>), shell commands (<code>!ls</code>, <code>!nvim README.md</code>), and more.</p>\n<h3 id=\"diff-review\">Diff Review<a class=\"headerlink\" href=\"#diff-review\" title=\"Permanent link\">&para;</a></h3>\n<p>Review uncommitted changes before asking Claude to commit:</p>\n<video src=\"https://github.com/user-attachments/assets/3c0c262b-2a23-4486-92c4-b97705a0819d\" autoplay loop muted playsinline style=\"max-width: 100%\"></video>\n\n<p>I used to switch back and forth to a terminal to run <code>git diff</code>.  Now I get something that I like more than <code>git diff</code> and without context switching.</p>\n<h3 id=\"shell-access\">Shell Access<a class=\"headerlink\" href=\"#shell-access\" title=\"Permanent link\">&para;</a></h3>\n<p>Run shell commands without leaving the UI:</p>\n<video src=\"https://github.com/user-attachments/assets/85f3dbe0-9a88-436e-aa9d-c1ba012c1f0e\" autoplay loop muted playsinline style=\"max-width: 100%\"></video>\n\n<p>I typically use this for <code>git log</code> and <code>vim</code>, but it's nice generally.</p>\n<p>There are loads more small features in Claude Chic, and more coming daily.  It's exciting to work on.</p>\n<h2 id=\"relationship-to-other-projects\">Relationship to other projects<a class=\"headerlink\" href=\"#relationship-to-other-projects\" title=\"Permanent link\">&para;</a></h2>\n<p>Related (and more mature) work:</p>\n<ul>\n<li>\n<p><strong>Claude Code:</strong> More robust.  Claude Chic uses the same <a href=\"https://github.com/anthropics/claude-agent-sdk-python\"><code>claude-agent-sdk</code></a> logic as Claude Code.</p>\n</li>\n<li>\n<p><a href=\"https://opencode.ai/\"><strong>OpenCode:</strong></a> Beautiful wrapper supporting any major LLM with its own agent logic.</p>\n</li>\n<li>\n<p><a href=\"https://willmcgugan.github.io/announcing-toad/\"><strong>Toad</strong></a>: LLM CLI in Textual by <a href=\"https://willmcgugan.github.io/\">Will McGugan</a>, Textual's creator.</p>\n</li>\n<li>\n<p><a href=\"https://docs.conductor.build/\">Conductor</a>: Mac App that provides many of the same features (design, worktrees, multi-agent)</p>\n</li>\n</ul>\n<h2 id=\"alpha-status\">Alpha Status<a class=\"headerlink\" href=\"#alpha-status\" title=\"Permanent link\">&para;</a></h2>\n<p>This software is <em>early</em>, and <em>full of bugs</em>.  It crashes regularly when we encounter new situations.  Even-so, I encourage adventurous <code>claude</code> users to put it through its paces and <a href=\"https://github.com/mrocklin/claudechic/issues/new\">raise issues</a>.  Development on this project is (as of 2026-01-25) extremely fast.</p>\n<h2 id=\"final-thoughts\">Final thoughts<a class=\"headerlink\" href=\"#final-thoughts\" title=\"Permanent link\">&para;</a></h2>\n<p>For users: AI is fast; we need to avoid becoming Amdahl's bottleneck.  Our developer tooling warrants a lot of reimagining today.</p>\n<p>For LLM providers: Please check out Textual.  It's a great technology.  (I have no financial stake in Textual)</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># If you use uv</span>\nuvx<span class=\"w\"> </span>claudechic<span class=\"w\"> </span>/welcome\n\n<span class=\"c1\"># If you use pip</span>\npip<span class=\"w\"> </span>install<span class=\"w\"> </span>claudechic\nclaudechic<span class=\"w\"> </span>/welcome\n</code></pre></div>\n<h2 id=\"video\">Video<a class=\"headerlink\" href=\"#video\" title=\"Permanent link\">&para;</a></h2>\n<p>If you prefer video, here's one of me explaining this project:</p>\n<div class=\"video-container\">\n<iframe src=\"https://www.youtube-nocookie.com/embed/2HcORToX5sU?autoplay=0&mute=0&loop=0&playlist=2HcORToX5sU\" title=\"Claude Chic Introduction\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div>", "image": "https://matthewrocklin.com/assets/images/social/introducing-claude-chic.png", "date_modified": "2026-02-13T16:16:52+00:00", "date_published": "2026-01-26T00:00:00+00:00", "authors": [{"name": "Matthew Rocklin"}], "tags": null}]}